{"courses":[{"id":"f862ffb9-124b-4962-9b35-876ae04e98b2","title":"Semantic Web Technologies 2018","url":"https://open.hpi.de/courses/f862ffb9-124b-4962-9b35-876ae04e98b2","start_date":"2018-01-15T08:00:00.000+00:00","end_date":"2018-02-26T20:00:00.000+00:00","teacher":"Dr. Harald Sack","code":"semanticweb2017","abstract":"The knowledge contained in the World Wide Web is available in interlinked documents written in natural language. To make use of this knowledge, technologies such as natural language processing, information retrieval, data and knowledge mining must be applied. Semantic Web technologies follow an alternative approach by complementing web documents with explicit semantics based on formal knowledge representations, such as e.g. ontologies.\r\nIn this MOOC, you will learn the fundamentals of Semantic Web technologies and how they are applied for knowledge representation in the World Wide Web. You will learn how to represent knowledge with ontologies and how to access and benefit from semantic data on the Web. Furthermore, you will also learn how to make use of Linked Data and the Web of Data, currently the most popular applications based on Semantic Web technologies.","description":"\u003cp\u003eThe web has become an object of our daily life and the amount of information in the web is ever growing. Besides plain texts, especially multimedia information such as graphics, audio or video have become a predominant part of the web\u0026#39;s information traffic. But, how can we find useful information within this huge information space? How can we make use of the knowledge contained in those web documents? Traditional search engines for example will reach the limits of their power, when it comes to understanding information content. The Semantic Web is an extension of the traditional web in the sense that information in the form of natural language text in the web will be complemented by its explicit semantics based on a formal knowledge representation. Thus, the meaning of information expressed in natural language can be accessed in an automated way and interpreted correctly, i.e. it can be ‘understood’ by machines.\u003c/p\u003e\n\n\u003cp\u003eSemantic Web technologies enable the explicit representation of knowledge and its further processing to deduce new knowledge from implicitly hidden knowledge. Thus, information access and information search will be more precise and more complete compared to today\u0026#39;s traditional information retrieval technology. Previously heterogeneous data can be mapped and combined based on common knowledge representation and schemata easily extended in a dynamic way.\u003c/p\u003e\n\n\u003cp\u003eIn this MOOC, you will learn the fundamentals of Semantic Web technologies and how they are applied for knowledge representation in the World Wide Web. You will learn how to represent knowledge with ontologies and how to access and benefit from semantic data on the Web. Furthermore, you will also learn how to make use of Linked Data and the Web of Data, currently the most popular applications based on Semantic Web technologies.\u003c/p\u003e\n\n\u003cp\u003eJoin openHPI\u0026#39;s official Twitter Feed: @openHPI\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eRequirements for this course:\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003ea basic knowledge of the foundations of mathematical logics, i.e. propositional logics and first order logics \u003c/p\u003e\u003c/li\u003e\n\u003cli\u003e\u003cp\u003ea basic understanding of web technologies, such as URL, http, HTML, and XML-based technologies\u003c/p\u003e\u003c/li\u003e\n\u003cli\u003e\u003cp\u003ea basic knowledge of database technology such as, e.g. relational databases and SQL query language\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n","image":"https://open.hpi.de/files/f1d16619-9813-4d59-96b3-d84908929b23?name=","next_events":[],"language":"en","categories":[],"status":"active"},{"id":"6172312d-b76b-4060-9ce5-d0d4493bbb3f","title":"Big Data Analytics","url":"https://open.hpi.de/courses/6172312d-b76b-4060-9ce5-d0d4493bbb3f","start_date":"2017-11-06T08:00:00.000+00:00","end_date":"2017-12-18T20:00:00.000+00:00","teacher":"Prof. Dr. Emmanuel Müller","code":"bigdata2017","abstract":"Der Schwerpunkt des Kurses \"Big Data Analytics\" liegt auf Data Mining Algorithmen zur Wissensextraktion und bildet die einzelnen Schritte des Knowledge Discovery in Databases (KDD) Prozess ab. Es werden die grundsätzlichen Data Mining Problemstellungen vorgestellt und verschiedene algorithmische Lösungen aus jedem Bereich verglichen. Darüber hinaus werden grundsätzliche Evaluierungsmethoden vorgestellt, um diese Data Mining Lösungen für konkrete Anwendungen bewerten zu können.","description":"\u003cp\u003eIn diesem Kurs werden grundlegende Kenntnisse im Bereich der Datenanalyse vermittelt.  Techniken zur Analyse großer Datenbestände stoßen bei Anwendern auf großes Interesse. Das Spektrum an Anwendungen ist breit und umfasst sowohl wirtschaftliche als auch wissenschaftliche Datenbestände: Klassische Branchen wie Banken und Versicherungen, neuere Akteure, insbesondere Internet-Firmen oder Betreiber neuartiger Informationsdienste und sozialer Medien, sowie Natur- und Ingenieurswissenschaften. In allen Bereichen besteht der Wunsch aus sehr großen Datenbeständen interessante Zusammenhänge zu extrahieren.\u003cbr\u003e\nIn dem Kurs geht es sowohl um die Aufbereitung von großen Datenbeständen als Voraussetzung für eine schnelle und leistungsfähige Analyse als auch um moderne Data Mining Techniken für die Analyse an sich. Anhand von aktuellen Anwendungen werden die grundlegenden Data Mining Problemstellungen aufgezeigt. Der Schwerpunkt liegt auf Data Mining Algorithmen zur Wissensextraktion und bildet die einzelnen Schritte des Knowledge Discovery in Databases (KDD) Prozess ab. Es werden die grundsätzlichen Data Mining Problemstellungen vorgestellt und verschiedene algorithmische Lösungen aus jedem Bereich verglichen. Darüber hinaus werden grundsätzliche Evaluierungsmethoden vorgestellt, um diese Data Mining Lösungen für konkrete Anwendungen bewerten zu können.\u003c/p\u003e\n","image":"https://open.hpi.de/files/4297ff7d-ea74-460b-ac21-5a99b09f583a?name=","next_events":[],"language":"de","categories":[],"status":"active"},{"id":"2a048e91-167f-4ff8-834a-3c8acd1ea716","title":"Social Media - What No One has Told You about Privacy","url":"https://open.hpi.de/courses/2a048e91-167f-4ff8-834a-3c8acd1ea716","start_date":"2017-10-23T08:00:00.000+00:00","end_date":"2017-11-06T20:00:00.000+00:00","teacher":"Dr. Anne Kayem","code":"ws-privacy2017","abstract":"In this 2 week workshop we discuss the emergence of social media, how the concept gained popularity and has now become the axle in collaborative communication on the Internet. We follow this with a presentation of basic approaches that you can use to protect your data and more importantly your privacy on these platforms. Everyone knows the odd feeling of discomfort when having added someone you actually don't know very well to yours friends' list or to the wrong category within your contacts. The participants will learn in this openHPI course that privacy is still a concern also for users who do not actively use the Internet.","description":"\u003cp\u003eIn this workshop we discuss the emergence of social media, how the concept gained popularity and has now become the axle in collaborative communication on the Internet. We follow this with a presentation of basic approaches that you can use to protect your data and more importantly your privacy on these platforms.\u003cbr\u003e\nHave you ever accepted a friendship request from the guy or girl you met at the corner store only to regret it the minute you clicked on “ACCEPT”? Or have you ever mistakenly allocated a “friend” to the wrong category and spent endless hours going through your list of 75,000 friends in order to find and reallocate your friend to the correct category?  If you have, then you probably know about the nagging feeling of discomfort that you try to ignore or comfort yourself by telling yourself that it does not matter. We discuss examples of cyber-attackers to illustrate to you that this feeling should be taken seriously. If you feel concerned that something is not quite right, it most likely is the case.\u003cbr\u003e\nFinally, we consider users like your Great Grandma who probably don’t use the Internet. If you have drifted away envying that peaceful time when social media did not exist, you could not be more mistaken. Privacy is still a concern for users who do not actively use the Internet!\u003c/p\u003e\n\n\u003cp\u003eJoin openHPI\u0026#39;s official Twitter Feed: \u003ca href=\"https://twitter.com/openHPI\"\u003e@openHPI\u003c/a\u003e\u003cbr\u003e\nYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de/\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/643aec98-523b-443a-81c0-c6710e541290?name=","next_events":[],"language":"en","categories":[],"status":"active"},{"id":"d013d1a5-0f2c-42b7-a5ad-2bf665585faf","title":"In-Memory Data Management 2017","url":"https://open.hpi.de/courses/d013d1a5-0f2c-42b7-a5ad-2bf665585faf","start_date":"2017-09-18T08:00:00.000+00:00","end_date":"2017-10-30T20:00:00.000+00:00","teacher":"Prof. Hasso Plattner","code":"imdb2017","abstract":"The „In-Memory Data Management\" MOOC in 2017 is the fifth iteration of Prof. Hasso Plattner's successful introduction into the inner mechanics of this recent technology. It is a repetition of the 2015 course and builds on the same, revised material. The course  focuses on the management of enterprise data in column-oriented in-memory databases. Latest hardware and software trends led to the development of a new revolutionary database technology that enables flexible and lightning-fast analysis of massive amounts of enterprise data. ","description":"\u003cp\u003eThe „In-Memory Data Management\u0026quot; MOOC in 2017 is the fifth iteration of Prof. Hasso Plattner\u0026#39;s successful introduction into the inner mechanics of this recent technology. It is a repetition of the 2015 course and builds on the same, revised material. The course  focuses on the management of enterprise data in column-oriented in-memory databases. Latest hardware and software trends led to the development of a new revolutionary database technology that enables flexible and lightning-fast analysis of massive amounts of enterprise data. The basic concepts and design principles of this technology are explained in detail. Beyond that, the implications of the underlying design principles for future enterprise applications and their development are discussed. The MOOC will explain in detail the differences and advantages of an in-memory column-oriented database in contrast to traditional row-oriented disk-based storages. \u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003e        • Requirements for Modern Enterprise Computing, Enterprise Application Characteristics\n        • Hardware Trends, Columnar Storage vs. Row Storage\n        • Dictionary Encoding, Compression\n        • Scans, Selects, Deletes, Inserts, Updates\n        • Indices, Joins\n        • Applications\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eParticipants of this course will receive access to the extensive reading material accompanying the lectures.\u003c/p\u003e\n","image":"https://open.hpi.de/files/3b39dcc6-e9f0-43df-b729-4cfab4b9300c?name=","next_events":[],"language":"en","categories":[],"status":"active"},{"id":"2b4683d5-c0ad-4da7-aa21-b4f0f30397c3","title":"Einführung in die Mathematik der Algorithmik","url":"https://open.hpi.de/courses/2b4683d5-c0ad-4da7-aa21-b4f0f30397c3","start_date":"2017-09-18T08:00:00.000+00:00","end_date":"2017-10-02T20:00:00.000+00:00","teacher":"Dr. Timo Kötzing, Dr. Pascal Lenzner, Dr. Thomas Bläsius","code":"mat-ws","abstract":"In allen Anwendungen in der Informatik steckt eine große Portion Mathematik. Insbesondere basieren viele Algorithmen, die uns täglich helfen (zum Beispiel Googles Suchalgorithmen oder Routenfindung bei Navigationssytemen) auf cleveren mathematischen Einsichten.    \r\n\r\nIn diesem Kurs wird die Sprache der modernen Mathematik vorgestellt. In der ersten Woche werden wir dazu die grundlegenden Bausteine einführen; dabei wird es um Quantoren und Junktoren, sowie Formalisierungen und Spezifikationen gehen. In der zweiten Woche werden wir diese Themen anhand ausgewählter Beispiele (zum Beispiel Logarithmengesetze und Landau-Notation) anwenden.\r\n\r\nFür diesen Kurs ist kein akademisches Vorwissen aus der Mathematik nötig. \r\n","description":"\u003cp\u003eIn allen Anwendungen in der Informatik steckt eine große Portion Mathematik. Insbesondere basieren viele Algorithmen, die uns täglich helfen (zum Beispiel Googles Suchalgorithmen oder Routenfindung bei Navigationssytemen) auf cleveren mathematischen Einsichten. \u003c/p\u003e\n\n\u003cp\u003eIn diesem Kurs wird die Sprache der modernen Mathematik vorgestellt. In der ersten Woche werden wir dazu die grundlegenden Bausteine einführen; dabei wird es um Quantoren und Junktoren, sowie Formalisierungen und Spezifikationen gehen. In der zweiten Woche werden wir diese Themen anhand ausgewählter Beispiele (zum Beispiel Logarithmengesetze und Landau-Notation) anwenden.\u003c/p\u003e\n\n\u003cp\u003eFür diesen Kurs ist kein akademisches Vorwissen aus der Mathematik nötig. \u003c/p\u003e\n","image":"https://open.hpi.de/files/66f96cb5-062e-4438-a794-44ab6d8acf31?name=","next_events":[],"language":"de","categories":[],"status":"active"},{"id":"a518af1b-d1b9-4f1a-ac21-71a20805635e","title":"Inspirations for Design: A Course on Human-Centered Research","url":"https://open.hpi.de/courses/a518af1b-d1b9-4f1a-ac21-71a20805635e","start_date":"2017-08-24T10:51:00.000+00:00","end_date":"2017-09-28T23:00:00.000+00:00","teacher":"Mana Taheri, Karen von Schmieden, Lena Mayer","code":"insights-2017","abstract":"Become a proficient explorer of the world around you and find inspirations that may lead to human-centered design solutions: This course will introduce you to the basics of design research.","description":"\u003cp\u003eThis course will introduce you to crucial methods in design research, which will help you to discover inspirations for innovative solutions. We take a task-based approach to build your competencies and skills: You will learn to spot workarounds, observe potential users in their context and explore the basic skills of conducting insightful interviews.\u003c/p\u003e\n\n\u003ch2\u003eLearning Objectives\u003c/h2\u003e\n\n\u003cul\u003e\n\u003cli\u003espot and analyze workarounds to identify user needs\u003cbr\u003e\u003c/li\u003e\n\u003cli\u003eprepare and conduct good qualitative interviews\u003cbr\u003e\u003c/li\u003e\n\u003cli\u003eanalyze interview notes and identify insights\u003cbr\u003e\u003c/li\u003e\n\u003cli\u003eevaluate the quality of your peers\u0026#39; work and provide constructive feedback\u003cbr\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eCourse Structure\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eWARM-UP /  Week 1\u003c/strong\u003e (24.8. – 30.8.2017)\u003cbr\u003e\nThis is a chance for you to introduce yourself and get to know the learning environment and your peers with the help of an exercise.\u003cbr\u003e\n\u003cem\u003eTime commitment: 1h – 1:40h\u003c/em\u003e   \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eOBSERVATION / Week 2\u003c/strong\u003e (31.8. – 6.9.2017)\u003cbr\u003e\nThe week focuses on the skill of careful observation and introduces you to workarounds and misuses.\u003cbr\u003e\n\u003cem\u003eTime commitment: 1h – 1:40h\u003c/em\u003e   \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eCONDUCTING QUALITATIVE INTERVIEWS / Week 3\u003c/strong\u003e (7.9. – 13.9.2017)\u003cbr\u003e\nThis week focuses on the role of qualitative interviewing and how to conduct a good interview.\u003cbr\u003e\n\u003cem\u003eTime commitment: 3h – 3:40h\u003c/em\u003e   \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eINFERRING MEANING FROM INTERVIEWS / Week 4\u003c/strong\u003e (13.9. – 20.9.2017)\u003cbr\u003e\nAfter you conducted your own interviews, this week\u0026#39;s module introduces you to interpreting your findings and inferring meaning from them - the first step towards gathering inspirations for design solution!\u003cbr\u003e\n\u003cem\u003eTime commitment: 1h – 1:20h\u003c/em\u003e   \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eWRAP-UP / Week 5\u003c/strong\u003e (20.9 – 28.9.2017)\u003cbr\u003e\nIn this week, we will provide a summary of what you have learned. We will talk about future steps and discuss some of the best assignment results with you.\u003cbr\u003e\n\u003cem\u003eTime commitment: 0:30h – 1h\u003c/em\u003e     \u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"/files/ca125315-afcc-4f37-9e8b-ffef8077da8a\" alt=\"enter image description here\"\u003e\u003c/p\u003e\n\n\u003ch2\u003eTarget Audience\u003c/h2\u003e\n\n\u003cp\u003eThis course is best suited for those who are curious about design thinking and human-centered approaches for solving problems. No prior knowledge is required. This course is designed for individual work; it is not necessary to find a team of co-participants. Peer reviews will be allocated to your online peers.    \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eQuotes from former learners:\u003c/strong\u003e   \u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003e“I think this MOOC is suitable for a broad audience and anyone can relate to it, even beginners.”\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003e“The way the skills are taught in this MOOC can be learned by anyone, no matter which country you are from, which culture you belong to or in which context you want to use the design skills.”\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003e“I realized during this course that my job is really about solving design problems. I am an architect, so my architectural design has to respond to my clients’ actual needs. Often, what my clients put on a piece of paper is not the same as what they really want. So interviewing and finding out about my clients’ hidden needs is an essential part of my job.”\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003e“This course helped me a lot in making decisions and finding inspiration. It opened up my prior assumption of design thinking and made me realize that design thinking is not limited to one specific scientific category.”\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003e“I am already thinking about ways to implement the qualitative interviewing method in my next projects.”\u003c/em\u003e\u003c/p\u003e\n\n\u003ch2\u003eNote\u003c/h2\u003e\n\n\u003cp\u003eThis course is part of a research project that investigates the potentials and challenges of teaching design thinking in an online environment. \nTherefore your participation in the course surveys and feedback are very valuable to us.\u003c/p\u003e\n","image":"https://open.hpi.de/files/cc686a58-577e-4f72-b92f-ed3802102f70?name=","next_events":[],"language":"en","categories":[],"status":"active"},{"id":"cb9c96b0-7165-4d68-bc58-d2113303eca0","title":"Embedded Smart Home","url":"https://open.hpi.de/courses/cb9c96b0-7165-4d68-bc58-d2113303eca0","start_date":"2017-07-03T08:00:00.000+00:00","end_date":"2017-07-17T20:00:00.000+00:00","teacher":"Martin Malchow, Matthias Bauer","code":"smarthome2017","abstract":"In der zweiten Auflage des interaktiven Kurses **Embedded Smart Home** dreht sich alles um die zentrale Verwaltung des Embedded Smart Home. Als Basis des Workshop-Projekts wird auch in diesem Jahr wieder ein Raspberry Pi dienen. Es wird Einblicke geben in die Nutzung von Sensoren, Einführung in die Ansteuerung externer Aktuatoren im Haushalt (z.B. Beleuchtung, Heizung oder Jalousien) und Anzeige und Steuerung des Embedded Smart Home über ein zentrales Display. Zusätzlich werden wir aufgrund vielfacher Wünsche einen Einblick in die externe Steuerung und Überwachung mit einer Kamera geben. Wer noch keine Erfahrung mit Programmierung in Python hat, kann sich vorher noch den Kurs \"Spielend Programmieren lernen\" ansehen.","description":"\u003cp\u003eHerzlich willkommen zur zweiten Auflage des interaktiven Kurses \u003cstrong\u003eEmbedded Smart Home\u003c/strong\u003e. Wir freuen uns, dich erneut in die Welt des Smart Home zu entführen. Nachdem wir euer Feedback zum letzten Kurs ausgewertet haben, wird sich in diesem Jahr alles um die zentrale Verwaltung eures Embedded Smart Home drehen. Als Basis des Workshop-Projekts wird auch in diesem Jahr wieder ein Raspberry Pi dienen. Somit könnt ihr den unter Umständen bereits erworbenen Raspberry Pi auch in diesem Jahr wiederverwenden. Es wird Einblicke geben in die Nutzung von Sensoren, Einführung in die Ansteuerung externer Aktuatoren im Haushalt (z.B. Beleuchtung, Heizung oder Jalousien) und Anzeige und Steuerung des Embedded Smart Home über ein zentrales Display. Zusätzlich werden wir aufgrund vielfacher Wünsche einen Einblick in die externe Steuerung und Überwachung mit einer Kamera geben.\u003cbr\u003e\nUm für die Programmierung gewappnet zu sein, könnt ihr euer Wissen aus dem zurückliegenden \u003cstrong\u003eEmbedded Smart Home\u003c/strong\u003e-Kurs und dem Python-Kurs (Spielend Programmieren lernen) nutzen und vertiefen. Wer diesen Kurs noch nicht besucht hat, kann dies auch jetzt noch im Archivmodus machen.   \u003c/p\u003e\n\n\u003cp\u003eWir werden auf dem Raspberry Pi die Linux-Distribution Raspian benutzen und für die Programmieraufgaben Python verwenden.\u003cbr\u003e\nDie Programmieraufgaben können auf einem von uns über die Lernplattform zur Verfügung gestellten Gerät durchgeführt werden. Wer möchte, kann aber auch ein eigenes Gerät nutzen. Kaufempfehlungen für zusätzliche Bastelkomponenten werden wir rechtzeitig vor Kursstart bekanntgegeben. Um den Kurs erfolgreich abzuschließen, sind beide Varianten geeignet und du kannst selbst entscheiden, welche Möglichkeit du bevorzugst.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eKauf der optionalen Hardware für Interessierte\u003c/strong\u003e  \u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003eUpdate:\u003c/em\u003e \nDie ersten Platinenlieferungen sind ausgeliefert.\u003c/p\u003e\n\n\u003cp\u003eDie ersten Entwicklungskits zum selberlöten bis Bestellung 510 sind ausgeliefert.\u003c/p\u003e\n\n\u003cp\u003eFür die Bestellungen mit gelöteter Platine müssen wir die Auslieferung leider auf Mitte Juni verschieben. Der Lieferant hat den Temperatur-/Feuchtigkeitssensor mit einer anderen Pinbelegung geliefert als unser Testsystem. Wir kümmern uns derzeit um Ersatz. Dadurch erhaltet ihr jetzt einen 2. Temperatur-/Feuchtigkeitssensor zum freien Einsatz kostenfrei.\nAlle Bestellungen mit einer Bestellnummer über 510 können ebenfalls Mitte Juni mit der Auslieferung rechnen.\u003c/p\u003e\n\n\u003cp\u003eFalls du dich für den Kauf der Hardware entscheidest, um das Projekt auch zu Hause nachbauen zu können, kannst du zwischen 2 Varianten wählen. Da es mit Conrad letztes Jahr leider große Lieferprobleme gab, haben wir uns entschieden, die Hardware über die Shop-Plattform, über die letztes Jahr auch die Platinen vertrieben wurden, anzubieten.\u003c/p\u003e\n\n\u003cp\u003eEs gibt folgende Entwicklungskits:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://supr.com/embedded-smart-home/kurs/2017/entwicklungskit-fuer-embedded-smart-home-kurs-2017\"\u003eEntwicklungskit zum Selberlöten\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://supr.com/embedded-smart-home/kurs/2017/entwicklungskit-mit-geloeteter-platine-fuer-embedded-smart-home-kurs-2017\"\u003eEntwicklungskit mit vorgelöteter Platine\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eIn jedem Fall benötigt ihr zusätzlich zum Set einen Raspberry 3 (empfohlen) oder 2 mit Speicherkarte und Stromversorgung (empfohlen: 2A). Zusätzlich empfiehlt es sich, wie auch für einen normalen Computer typisch, Maus (USB) und Tastatur (USB) anzuschließen. Für die Programmierung ist die Verwendung des Touch-Displays ungeeignet. \u003c/p\u003e\n\n\u003cp\u003eDie Entwicklungskits bestehen aus:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e7\u0026quot; HDMI-Multi-Touch-Display\u003c/li\u003e\n\u003cli\u003ePlatine für sofortigen Einsatz gelötet\u003c/li\u003e\n\u003cli\u003eKamera (1080p)\u003c/li\u003e\n\u003cli\u003e\u003cp\u003erote und grüne LED\u003c/p\u003e\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eSensoren (für den Kurs relevant)\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eBewegungs-Sensor\u003c/li\u003e\n\u003cli\u003eGas-Sensor\u003c/li\u003e\n\u003cli\u003eTemperatur-/Feuchtigkeits-Sensor\u003c/li\u003e\n\u003cli\u003eFlammen-Sensor\u003c/li\u003e\n\u003cli\u003eGeräusch-Sensor\u003c/li\u003e\n\u003cli\u003eLicht-Sensor\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eSensoren (für den Kurs nicht relevant, zum Ausprobieren)\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eDS1302 RTC - Zeit-Sensor\u003c/li\u003e\n\u003cli\u003eRegentropfen-Sensor\u003c/li\u003e\n\u003cli\u003eBodenfeuchtigkeits-Sensor\u003c/li\u003e\n\u003cli\u003eUltraschall-Sensor\u003c/li\u003e\n\u003cli\u003eLaser (in Verbindung mit Lichtsensor als Lichtschranke einsetzbar)\u003c/li\u003e\n\u003cli\u003eVibrations-Sensor\u003c/li\u003e\n\u003cli\u003eKipp-Sensor (Tilt)\u003c/li\u003e\n\u003cli\u003eInfrarot-Hindernis-Sensor\u003c/li\u003e\n\u003cli\u003e315MHz Empfänger und Sender\u003c/li\u003e\n\u003cli\u003eInfrarot-Grenzlinien-Sensor\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e2x 40 Pin Wannen-Connector\u003c/p\u003e\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eAnschlusskabel für Bewegungssensor\u003c/p\u003e\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eFlachkabel inkl. Stecker\u003c/p\u003e\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eWiderstände\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003eUpdate 08.05.2017:\u003c/strong\u003e\nFür das zusätzliche Gehäuse sind leider nur die Hälfte der notwendigen Bestellungen zusammengekommen. Daher können wir es leider nicht fertigen und ausliefern. Alle betroffenen Käufer erhalten in den nächsten Tagen eine E-Mail. Durch Angabe der Kontonummer oder des PayPal-Accounts erhalten die Vorbesteller den Betrag für das Gehäuse zurück.\u003c/p\u003e\n\n\u003cp\u003eWenn jemand einen 3D-Drucker hat, kann er das Gehäuse mit den Dateien für \u003ca href=\"/files/0719d308-e821-45de-9700-167980df70d3\"\u003eGrundplatte\u003c/a\u003e und \u003ca href=\"/files/4bb95abe-4ff3-4ecb-b613-55b35e7c2769\"\u003eDeckel\u003c/a\u003e selbst drucken.\u003c/p\u003e\n","image":"https://open.hpi.de/files/83063d1d-e891-4438-bfe9-12b63cce1a1e?name=","next_events":[],"language":"de","categories":[],"status":"active"},{"id":"c9fb28f3-bf89-4eb9-a9f4-8ee36e4326a7","title":"Mainframes","url":"https://open.hpi.de/courses/c9fb28f3-bf89-4eb9-a9f4-8ee36e4326a7","start_date":"2017-06-05T08:00:00.000+00:00","end_date":"2017-07-17T20:00:00.000+00:00","teacher":"Wolfram Greis, Prof. Dr. Philipp Brune, Prof. Dr. Andreas Polze ","code":"mainframes2017","abstract":"Kaum jemand kennt sie. Und dennoch hat man täglich mit ihnen zu tun. Wer an einem Bankautomaten Geld abhebt, wer einen Flug bucht, wer mit der Deutschen Bahn unterwegs ist: Immer arbeiten im Hintergrund Mainframes, welche die wirklich entscheidende Arbeit verrichten und dafür sorgen, dass alles sicher und ohne Datenverlust vonstatten geht. Mehr als 70 Prozent der Global 500 arbeiten mit diesen Großrechnern.     \r\n\r\nProf. Andreas Polze leitet den Kurs \"Mainframes\", in dem Referenten aus dem Academic Mainframe Consortium und von IBM zu Wort kommen werden. Dieses Consortium fördert die akademische Ausbildung auf Mainframe Computern und hat sich u.a. das Ziel gesetzt, die Forschung und Entwicklung in diesem Bereich zu fördern und voranzutreiben. Der Kurs ist eine Einführung in das Thema und wird insbesondere auf die Fragen der Mainframe-Architektur und der Anwendungsentwicklung eingehen. Außerdem werden Datenbanken und Transaktionssysteme, das Thema Sicherheit und Mainframes sowie Storage Management im Kurs behandelt werden.\r\n\r\nDieser Kurs richtet sich an alle, die sich für das Thema Mainframes interessieren und über grundlegende Kenntnisse in Informatik und Algorithmik verfügen.","description":"\u003cp\u003eKaum jemand kennt sie. Und dennoch hat man täglich mit ihnen zu tun. Wer an einem Bankautomaten Geld abhebt, wer einen Flug bucht, wer mit der Deutschen Bahn unterwegs ist: Immer arbeiten im Hintergrund Mainframes, welche die wirklich entscheidende Arbeit verrichten und dafür sorgen, dass alles sicher und ohne Datenverlust vonstatten geht. Mehr als 70 Prozent der Global 500 arbeiten mit diesen Großrechnern.     \u003c/p\u003e\n\n\u003cp\u003eProf. Andreas Polze leitet den Kurs \u0026quot;Mainframes\u0026quot;, in dem Referenten aus dem Academic Mainframe Consortium und von IBM zu Wort kommen werden. Dieses Consortium fördert die akademische Ausbildung auf Mainframe Computer und hat sich u.a. das Ziel gesetzt, die Forschung und Entwicklung in diesem Bereich zu fördern und voranzutreiben. Der Kurs ist eine Einführung in das Thema und wird insbesondere auf die Fragen der Mainframe-Architektur und der Anwendungsentwicklung eingehen. Außerdem werden Datenbanken und Transaktionssysteme, das Thema Sicherheit und Mainframes sowie Storage Management im Kurs behandelt werden.\u003c/p\u003e\n\n\u003cp\u003eDieser Kurs richtet sich an alle, die sich für das Thema Mainframes interessieren und über grundlegende Kenntnisse in Informatik und Algorithmik verfügen.\u003c/p\u003e\n\n\u003cp\u003eDer Arbeitsaufwand dieses Kurses entspricht 2 ECTS Punkten.   \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eNeu - jetzt buchbar:\u003c/strong\u003e \n\u0026lt;div style=\u0026quot;display: inline-block; overflow: hidden; height: 32px; line-height: 26px; font-size: 1.1rem; font-weight: bold; white-space: nowrap; transition: all .1s; background-color: #de6212; padding: 3px 5px;\u0026quot;\u0026gt;\n\u0026lt;a href=\u0026quot;/pages/document_types#qualifiziertes-zertifikat\u0026quot; style=\u0026quot;padding: 10px 5px; line-height: 26px; color: #ffffff\u0026quot;\u0026gt;Qualifizierte Zertifikate\u0026lt;/a\u0026gt;\u0026lt;/div\u0026gt;  \u003c/p\u003e\n\n\u003cp\u003eFolgen Sie uns auf Twitter: \u003ca href=\"https://twitter.com/openHPI\"\u003e@openHPI\u003c/a\u003e Nutzen Sie den Hashtag @mainframes2017 für Kommentare zu diesem Kurs.\u003cbr\u003e\nBesuchen Sie uns auf Facebook: \u003ca href=\"https://www.facebook.com/OpenHPI/\"\u003ehttps://www.facebook.com/OpenHPI\u003c/a\u003e  \u003c/p\u003e\n\n\u003cp\u003eWeitere Video Lectures finden Sie unter \u003ca href=\"http://www.tele-task.de/\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/83e9b527-5082-4423-a4bc-30d7b22accb6?name=","next_events":[],"language":"de","categories":[],"status":"active"},{"id":"5cda518c-3c46-426c-a096-700c7d4e1295","title":"Wie funktioniert eine Suchmaschine?","url":"https://open.hpi.de/courses/5cda518c-3c46-426c-a096-700c7d4e1295","start_date":"2017-05-29T08:00:00.000+00:00","end_date":"2017-06-20T20:00:00.000+00:00","teacher":"Dr. Ralf Krestel","code":"searchengine2017","abstract":"Das Speichern von Information und Wissen ist seit Jahrtausenden Teil der Menschheitsgeschichte. Die Erfindung des Buchdrucks hat zu enormen Bibliotheken geführt, um das vorhandene Wissen zu konservieren und zugänglich zu machen. Mit den riesigen Mengen an Informationen und Wissen wurde es aber auch immer schwerer, relevante von irrelevanter Information zu trennen und Informationen wiederzufinden. Mit dem Erfolg des Internets schließlich kam es zu einer Explosion an öffentlich zugänglichen Informationen und neue Inhalte werden in nie dagewesenem Ausmaß produziert. Dieser Informationsflut Herr zu werden haben sich Suchmaschinen verschrieben.    \r\n\r\nIn diesem Kurs wollen wir in die technischen Grundlagen einführen und einfache Konzepte des „Information Retrievals“ im Webkontext näher beleuchten: Wie ist eine Suchmaschine aufgebaut? Was passiert, wenn ich eine Suchanfrage eintippe? Nach welchen Kriterien werden Ergebnislisten erstellt?\r\nAuf Themen wie Suchmaschinenoptimierung (SEO) oder die konkrete Benutzung bestimmter Suchmaschinen wird dabei nicht näher eingegangen. ","description":"\u003cp\u003eDas Speichern von Information und Wissen ist seit Jahrtausenden Teil der Menschheitsgeschichte. Die Erfindung des Buchdrucks hat zu enormen Bibliotheken geführt, um das vorhandene Wissen zu konservieren und zugänglich zu machen. Mit den riesigen Mengen an Informationen und Wissen wurde es aber auch immer schwerer, relevante von irrelevanter Information zu trennen und Informationen wiederzufinden. Mit dem Erfolg des Internet schließlich kam es zu einer Explosion an öffentlich zugänglichen Informationen und neue Inhalte werden in nie dagewesenem Ausmaß produziert. Dieser Informationsflut Herr zu werden haben sich Suchmaschinen verschrieben.    \u003c/p\u003e\n\n\u003cp\u003eIn diesem Kurs wollen wir in die technischen Grundlagen einführen und einfache Konzepte des „Information Retrievals“ im Webkontext näher beleuchten: Wie ist eine Suchmaschine aufgebaut? Was passiert, wenn ich eine Suchanfrage eintippe? Nach welchen Kriterien werden Ergebnislisten erstellt?\nAuf Themen wie Suchmaschinenoptimierung (SEO) oder die konkrete Benutzung bestimmter Suchmaschinen wird dabei nicht näher eingegangen. \u003c/p\u003e\n\n\u003cp\u003eKursbild: flickr / \u003ca href=\"https://www.flickr.com/photos/t_buchtele/3422507814/in/photolist-6drfkq-n9CP7m-e9m84c-71DoT6-waVK1F-4U5zqM-8f9tK6-7XaaG-btyJvB-jwYYA-rC7u6U-6WTMn-5CCnJZ-2Bq24-btkkge-9wi4qt-bx8LiM-oyHk2f-eihtGJ-7q3dez-8mawxZ-6osDpJ-74NZBo-ap1t8T-cA1piy-btkhBx-ebQ1NE-e3qErw-oHA7Z-spTe9-hwiC2w-7Uvpc9-btyDJK-ebQ8J3-ebQ7Fm-hf9NH-btkhmX-8AjyRQ-dbo2ok-aqVTwR-ng7HDv-ebQ8qA-FAU9wQ-odLzwY-bGTFqB-EwdF6C-6Yz7MB-ioAi6G-ebJtV8-c9PSzQ/\"\u003et_buchtele\u003c/a\u003e\u003c/p\u003e\n","image":"https://open.hpi.de/files/d31269be-7b41-460c-8e6e-87285de4717f?name=","next_events":[],"language":"de","categories":[],"status":"active"},{"id":"32558839-779e-42f9-871e-18c8df823b83","title":"Java Workshop: Einführung in eine Java- Programmierumgebung (IDE) ","url":"https://open.hpi.de/courses/32558839-779e-42f9-871e-18c8df823b83","start_date":"2017-05-01T08:00:00.000+00:00","end_date":"2017-05-15T20:00:00.000+00:00","teacher":"","code":"javawork2017","abstract":"Dieser zweiwöchige MOOC-Workshop wird als Ergänzung zum Kurs [\"Objektorientierte Programmierung mit Java 2017\"][1]  angeboten. Unseren Kursteilnehmern wird eine Einführung in die Benutzung einer Java IDE (Integrated Development Environment = Programmierumgebung) gegeben.\r\n\r\nMit diesem Kurs möchten wir unsere Teilnehmer befähigen, das erlernte Wissen aus dem Programmierkurs zu festigen und eigene Programme umzusetzen.\r\n\r\n\r\n  [1]: https://open.hpi.de/courses/javaeinstieg2017","description":"\u003cp\u003eDieser zweiwöchige MOOC-Workshop wird als Ergänzung zum Kurs \u003ca href=\"https://open.hpi.de/courses/javaeinstieg2017\"\u003e\u0026quot;Objektorientierte Programmierung mit Java 2017\u0026quot;\u003c/a\u003e  angeboten. Unseren Kursteilnehmern wird eine Einführung in die Benutzung einer Java IDE (Integrated Development Environment = Programmierumgebung) gegeben.\u003c/p\u003e\n\n\u003cp\u003eMit diesem Kurs möchten wir unsere Teilnehmer befähigen, das erlernte Wissen aus dem Programmierkurs zu festigen und eigene Programme umzusetzen.\u003c/p\u003e\n\n\u003cp\u003eWeitere Video Lectures finden Sie unter \u003ca href=\"http://www.tele-task.de/\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/c7958551-18ed-41c7-809c-0ee8102f7be7?name=","next_events":[],"language":"de","categories":[],"status":"archive"},{"id":"702cbd2a-c84c-4b37-923a-692d7d1532d0","title":"Objektorientierte Programmierung in Java","url":"https://open.hpi.de/courses/702cbd2a-c84c-4b37-923a-692d7d1532d0","start_date":"2017-03-27T08:00:00.000+00:00","end_date":"2017-05-14T22:00:00.000+00:00","teacher":"","code":"javaeinstieg2017","abstract":"In diesem openHPI Einsteigerkurs beschäftigen wir uns mit den Grundlagen der objektorientierten Programmierung und lösen gemeinsam mit Detektiv Duke einen mysteriösen Entführungsfall.\r\n\r\nWesentliches Merkmal der objektorientierten Programmierung ist die geeignete Verteilung von Aufgaben auf Komponenten, die jeweils eigene Eigenschaften und Verhaltensweisen aufweisen und sich gegenseitig beeinflussen können.\r\n\r\nDurch regelmäßige Programmieraufgaben wird das Gelernte angewendet und die Teilnehmer erwerben praktische Kenntnisse in der Programmiersprache Java. Abgerundet wird der Kurs durch einen vertiefenden Exkurs zur Modellierung von Klassen und deren Abhängigkeiten.\r\n\r\n\r\nVoraussetzungen für diesen Kurs sind lediglich ein Interesse an Programmierung und ein Computer mit Internetzugang. Vorhergehende Programmiererfahrung ist hilfreich, aber nicht notwendig. Um erfolgreich am Kurs teilzunehmen, sollte man 3-6 Stunden Zeit pro Woche einplanen.\r\n","description":"\u003cp\u003eIn diesem openHPI Einsteigerkurs beschäftigen wir uns mit den Grundlagen der objektorientierten Programmierung und lösen gemeinsam mit Detektiv Duke einen mysteriösen Entführungsfall.\u003c/p\u003e\n\n\u003cp\u003eWesentliches Merkmal der objektorientierten Programmierung ist die geeignete Verteilung von Aufgaben auf Komponenten, die jeweils eigene Eigenschaften und Verhaltensweisen aufweisen und sich gegenseitig beeinflussen können.\u003c/p\u003e\n\n\u003cp\u003eDurch regelmäßige Programmieraufgaben wird das Gelernte angewendet und die Teilnehmer erwerben praktische Kenntnisse in der Programmiersprache Java. Abgerundet wird der Kurs durch einen vertiefenden Exkurs zur Modellierung von Klassen und deren Abhängigkeiten.\u003c/p\u003e\n\n\u003cp\u003eVoraussetzungen für diesen Kurs sind lediglich ein Interesse an Programmierung und ein Computer mit Internetzugang. Vorhergehende Programmiererfahrung ist hilfreich, aber nicht notwendig.\u003c/p\u003e\n","image":"https://open.hpi.de/files/fb245db7-5ce0-4106-87ba-78bb1ea11f10?name=","next_events":[],"language":"de","categories":[],"status":"archive"},{"id":"71934f16-ffeb-4abd-a256-c8818fbc567e","title":"Web-Technologien","url":"https://open.hpi.de/courses/71934f16-ffeb-4abd-a256-c8818fbc567e","start_date":"2017-02-06T08:00:00.000+00:00","end_date":"2017-04-07T22:00:00.000+00:00","teacher":"","code":"webtech2017","abstract":"Das WWW (World Wide Web) oder kurz einfach nur Web, hat die Welt auf unvorstellbare Weise verändert. Es hat eine neue digitale Welt geschaffen, die eng mit unserer echten Welt verflochten ist. Dadurch ist möglich geworden, was lange undenkbar schien: weltweite Kommunikation innerhalb von Sekunden, Filme schauen auf dem Smartphone, mit weit entfernten Menschen gemeinsam Spiele spielen oder Fotos ansehen und Einkäufe oder Bankgeschäfte von zuhause aus erledigen.\r\n\r\nIn unserem MOOC \"Web-Technologien\" lernen Sie, wie das alles funktioniert.","description":"\u003cp\u003eUnser Kurs zu den Grundlagen der Web-Technologie beschäftigt sich zunächst mit den wichtigsten Basistechnologien: URI, HTTP, HTML, CSS und XML. Sollte sich das kryptisch für Sie anhören, seien Sie versichert, dass Sie sehr bald verstehen werden, was es damit auf sich hat. Wir werden dann den Fokus auf Web Services und die Programmierung im Web legen und dabei auch versuchen, Interessierten grundlegende praktische Kenntnisse zu vermitteln. Schließlich werden wir uns auch mit dem Thema \u0026quot;Suchmaschinen\u0026quot; beschäftigen und wie diese Anwendungen, die aus unserem Internet-Alltag nicht mehr wegzudenken sind, eigentlich funktionieren. Der Kurs schließt mit einem Blick auf aktuelle Themen wie das Social Web, das Service Web und das Semantic Web.\u003c/p\u003e\n\n\u003cp\u003eDieser Kurs richtet sich an zum einen an interessierte, Internet-affine Laien, die verstehen möchten, welche Technologien hinter dem Alltagsphänomen \u0026quot;World Wide Web\u0026quot; stecken. Zum anderen sprechen wir (angehende) IT-Spezialisten an, die sich einen ersten Überblick über das Thema verschaffen oder ihr Wissen strukturiert auffrischen möchten.  \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eKursumfang:\u003c/strong\u003e 6 Wochen + 2 Wochen für die Abschlussprüfung \u003c/p\u003e\n\n\u003cp\u003eJe nach Vorkenntnissen und persönlichen Lernzielen beträgt der Arbeitsaufwand mindestens 3-6 Stunden pro Woche. Die geschätzte Zeit beinhaltet die Beschäftigung mit den bereitgestellten Lernmaterialien und Selbsttests, hinzu kommt noch die - äußerst hilfreiche - Teilnahme an den Diskussionen im Forum. Außerdem ist zusätzlich für jede Woche eine benotete Hausaufgabe mit einer Bearbeitungszeit von 60 Minuten angesetzt. Der Arbeitsaufwand für diesen Kurs entspricht 2 ECTS Punkten.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eNeu - jetzt buchbar:\u003c/strong\u003e \n\u0026lt;div style=\u0026quot;display: inline-block; overflow: hidden; height: 32px; line-height: 26px; font-size: 1.1rem; font-weight: bold; white-space: nowrap; transition: all .1s; background-color: #de6212; padding: 3px 5px;\u0026quot;\u0026gt;\n\u0026lt;a href=\u0026quot;/pages/document_types#qualifiziertes-zertifikat\u0026quot; style=\u0026quot;padding: 10px 5px; line-height: 26px; color: #ffffff\u0026quot;\u0026gt;Qualifizierte Zertifikate\u0026lt;/a\u0026gt;\u0026lt;/div\u0026gt;  \u003c/p\u003e\n\n\u003cp\u003eFolgen Sie uns auf Twitter: \u003ca href=\"https://twitter.com/openHPI\"\u003e@openHPI\u003c/a\u003e  Nutzen Sie den Hashtag #webtech2017 für Kommentare zu diesem Kurs.\u003cbr\u003e\nBesuchen Sie uns auf Facebook: \u003ca href=\"https://www.facebook.com/OpenHPI/\"\u003ehttps://www.facebook.com/OpenHPI\u003c/a\u003e  \u003c/p\u003e\n\n\u003cp\u003eKursbildquelle: jmtosses / \u003ca href=\"https://www.flickr.com/photos/jmt/3838802631/in/photolist-6RdShg-5FEomd-dNTE9j-7FUMaN-4reUTb-744i35-pboedq-fG1Nz1-9o37gL-5mGRNj-bggAZz-psABfH-5mGRK3-otewDG-5mGRPs-5mGRM5-5mCBFa-5mGRFN-5mGRLf-m3qGTX-GCPob-n2J5n-243BrF-5HLWbU-p9zCdy-eqb3h-pqQRym-kYwZxk-GCPg9-bEtm3p-9JnRKp-6fGffL-cAswZb-cEtrZw-pboY5e-pboxjy-pbnJYt-n9Nxa3-BMYbN-4V7PPt-dw5ZnX-cacNad-cNpobo-edZr5c-9hVjTU-nWApzE-cyNqNJ-tC2o4q-3qHFZ-ahKGfo\"\u003eFlickr\u003c/a\u003e - \u003ca href=\"https://creativecommons.org/licenses/by-nc/2.0/\"\u003eCC BY-NC-ND 2.0\u003c/a\u003e\u003c/p\u003e\n","image":"https://open.hpi.de/files/8676a1b2-f24d-4e89-9340-7ff3fa29b7e7?name=","next_events":[],"language":"de","categories":["IT Basic Knowledge"],"status":"archive"},{"id":"9ca8bf5b-a164-47ff-a852-27d1fee9f03c","title":"Advent MOOC","url":"https://open.hpi.de/courses/9ca8bf5b-a164-47ff-a852-27d1fee9f03c","start_date":"2016-11-27T08:00:00.000+00:00","end_date":"2017-01-02T12:00:00.000+00:00","teacher":"","code":"adv","abstract":"Herzlich willkommen zu unserem Advent-MOOC. Mit diesem Mini-MOOC möchten wir euch ein wenig die Adventszeit versüßen. Insgesamt haben wir 4 Überraschungen vorbereitet, die wir jeweils am Sonntag bekanntgeben. Wie gewohnt wird es kurze Videobotschaften geben -  mehr wird noch nicht verraten. Viel Spaß!\r\n\r\nWelcome to our Advent MOOC. In the coming weeks, we just want to make you smile with our “mini MOOC.” There are a total of 4 surprises that we will reveal to you on the coming Sundays before Christmas. As you already know from our other courses, there will be short video messages – but we don’t want to tell you any more than that. Enjoy!\r\n","description":"\u003cp\u003eHerzlich willkommen zu unserem Advent-MOOC. Mit diesem Mini-MOOC möchten wir euch ein wenig die Adventszeit versüßen. Insgesamt wird es 4 Überraschungen geben, die wir jeweils am Sonntag bekanntgeben. Wie gewohnt wird es kurze Videobotschaften geben -  mehr wird noch nicht verraten. Viel Spaß!\u003c/p\u003e\n\n\u003cp\u003eWelcome to our Advent MOOC. In the coming weeks, we just want to make you smile with our “mini MOOC.” There are a total of 4 surprises that we will reveal to you on the coming Sundays before Christmas. As you already know from our other courses, there will be short video messages – but we don’t want to tell you any more than that. Enjoy!\u003c/p\u003e\n","image":"https://open.hpi.de/files/611336cd-065c-47a5-ad19-4b557914f772?name=","next_events":[],"language":"de","categories":[],"status":"archive"},{"id":"01081ca0-f53d-4437-8292-4a6b5a9ec59d","title":"Code of Life - When Computer Science Meets Genetics  ","url":"https://open.hpi.de/courses/01081ca0-f53d-4437-8292-4a6b5a9ec59d","start_date":"2016-11-14T08:00:00.000+00:00","end_date":"2016-12-05T23:30:00.000+00:00","teacher":"Dr.-Ing. Matthieu-P. Schapranow","code":"ehealth2016","abstract":"Welcome to the class: we are very excited that you are interested in learning more about the foundations of life. In this openHPI course, we will give an introduction about components of human cells and their functions. We dive into the cell core to explore the Deoxyribonucleic Acid (DNA), its structure, and how it stores the code of life. Furthermore, we will explore how to discover genetic variants and mutations and how to assess their impact on the cell functions and the whole human body. Ultimately, we will outline how individual genetic variants can be connected to complex diseases, such as cancer. Just two decades ago, all these tasks would have been impossible due to missing knowledge about the DNA and a lack of computational power. As a result, you will learn basic concepts about how to incorporate latest computer science aspects to explore the code of life interactively. ","description":"\u003cp\u003eWelcome to the class: we are very excited that you are interested in learning more about the foundations of life. In this openHPI course, we will give an introduction about components of human cells and their functions. We dive into the cell core to explore the Deoxyribonucleic Acid (DNA), its structure, and how it stores the code of life. Furthermore, we will explore how to discover genetic variants and mutations and how to assess their impact on the cell functions and the whole human body. Ultimately, we will outline how individual genetic variants can be connected to complex diseases, such as cancer. Just two decades ago, all these tasks would have been impossible due to missing knowledge about the DNA and a lack of computational power. As a result, you will learn basic concepts about how to incorporate latest computer science aspects to explore the code of life interactively. \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eNews: Pre-course reading materials as well as additional information about our projects focusing on digital health are available on our \u003ca href=\"https://we.analyzegenomes.com/\"\u003eAnalyze Genomes website\u003c/a\u003e.\u003c/strong\u003e \u003c/p\u003e\n\n\u003cp\u003eJoin openHPI\u0026#39;s official Twitter Feed: \u003ca href=\"https://twitter.com/openHPI\"\u003e@openHPI\u003c/a\u003e. Use the hashtag \u003ca href=\"https://twitter.com/search?q=#codeoflife\u0026src=typd\"\u003e#codeoflife\u003c/a\u003e to join and contribute to social media conversations about this course.\u003cbr\u003e\nAdditional video lecturing material can be found at \u003ca href=\"http://www.tele-task.de/\"\u003ewww.tele-task.de\u003c/a\u003e .\nPhoto source: © Sergey Nivens / Fotolia\u003c/p\u003e\n","image":"https://open.hpi.de/files/91cef4e1-a5d6-4993-9556-6225e268686f?name=","next_events":[],"language":"en","categories":["Recent developments"],"status":"archive"},{"id":"ce690cfb-0ba2-4bb0-afdd-bb8e9528c260","title":"Linked Data Engineering","url":"https://open.hpi.de/courses/ce690cfb-0ba2-4bb0-afdd-bb8e9528c260","start_date":"2016-10-17T08:00:00.000+00:00","end_date":"2016-12-12T23:30:00.000+00:00","teacher":"Prof. Dr. Harald Sack","code":"semanticweb2016","abstract":"We are surrounded by data everywhere. By helping us to make better decisions, data plays a central role in our daily lives. An ever increasing number of data sources, driven by individuals and organizations, contribute to this data deluge by sharing their data with others. However, data is locked up behind proprietary, unreliable, and even unstable programming interfaces that prevent us from optimally making use of it.   \r\nLinked Data has the potential to revolutionize the way we discover, access, integrate, and use data; just in the way the World Wide Web has revolutionized the way we consume and connect documents.  \r\nThis course will introduce you to the basic principles and technologies of Linked Data to enable data sharing and reuse on a massive scale. Held together by ontologies, i.e. knowledge representations based on Semantic Web technologies, Linked Data serves as the central building block of the emerging Web of Data.\r\n\r\n","description":"\u003cp\u003eWe are surrounded by data everywhere. By helping us to make better decisions, data plays a central role in our daily lives. An ever increasing number of data sources, driven by individuals and organizations, contribute to this data deluge by sharing their data with others. However, data is locked up behind proprietary, unreliable, and even unstable programming interfaces that prevent us from optimally making use of it. \nLinked Data has the potential to revolutionize the way we discover, access, integrate, and use data; just in the way the World Wide Web has revolutionized the way we consume and connect documents. \nThis course will introduce you to the basic principles and technologies of Linked Data to enable data sharing and reuse on a massive scale. Held together by ontologies, i.e. knowledge representations based on Semantic Web technologies, Linked Data serves as the central building block of the emerging Web of Data.  \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eNew - available now:\u003c/strong\u003e \n\u0026lt;div style=\u0026quot;display: inline-block; overflow: hidden; height: 32px; line-height: 26px; font-size: 1.1rem; font-weight: bold; white-space: nowrap; transition: all .1s; background-color: #de6212; padding: 3px 5px;\u0026quot;\u0026gt;\n\u0026lt;a href=\u0026quot;/pages/document_types#qualifiziertes-zertifikat\u0026quot; style=\u0026quot;padding: 10px 5px; line-height: 26px; color: #ffffff\u0026quot;\u0026gt;Qualified Certificates\u0026lt;/a\u0026gt;\u0026lt;/div\u0026gt;\u003cbr\u003e\nThe workload of this course is equivalent to 2 ECTS credits.\u003c/p\u003e\n","image":"https://open.hpi.de/files/c0535c9a-c412-44a8-8c8d-72b3089711a2?name=","next_events":[],"language":"en","categories":["IT Technical Principles"],"status":"archive"},{"id":"76d26cf2-09ba-48e1-bfb7-874dc42300b8","title":"Zusammenhänge entdecken, Phänomene verstehen: Programmieren mit Etoys","url":"https://open.hpi.de/courses/76d26cf2-09ba-48e1-bfb7-874dc42300b8","start_date":"2016-10-10T08:00:00.000+00:00","end_date":"2016-10-24T23:30:00.000+00:00","teacher":"Tim Felgentreff","code":"etoys2016","abstract":"Viele Phänomene in komplexen Systeme mit vielen Teilnehmern widersprechen der Intuition zunächst. In solchen Fällen helfen interaktive Visualisierungen und Experimentierumgebungen, um das Verständnis zu erleichtern. Mit ein wenig Programmierkenntnis kann man solche Experimente selbst erstellen, um interessante Phänomene zu verstehen.  \r\nIn diesem Kurs lernen wir, wie man die Ausbreitung von Krankheiten am Computer simulieren kann, sehen interaktiv, wie Impfungen auch die nicht geimpften Menschen schützen, und wir entdecken, was das mit Waldbränden zu tun hat. Teilnehmer können sich die Zusammenhänge in solchen Systemen spielerisch erschließen. \r\nFür die Simulationen, die wir programmieren, ist keine vorherige Programmiererfahrung nötig und wir lernen auch, wie man Werkzeuge programmiert, um diese Systeme grafisch zu analysieren. Wir benutzen in diesem Kurs die visuelle Programmiersprache Squeak/Etoys und ihre Werkzeuge zum Simulieren und Animieren von Systemen mit vielen Teilnehmern.  \r\nDer Kurs richtet sich an Jugendliche ab 12 Jahren.\r\n","description":"\u003cp\u003eViele Phänomene in komplexen Systeme mit vielen Teilnehmern widersprechen der Intuition zunächst. In solchen Fällen helfen interaktive Visualisierungen und Experimentierumgebungen, um das Verständnis zu erleichtern. Mit ein wenig Programmierkenntnis kann man solche Experimente selbst erstellen, um interessante Phänomene zu verstehen.\u003cbr\u003e\nIn diesem Kurs lernen wir, wie man die Ausbreitung von Krankheiten am Computer simulieren kann, sehen interaktiv, wie Impfungen auch die nicht geimpften Menschen schützen, und wir entdecken, was das mit Waldbränden zu tun hat. Teilnehmer können sich die Zusammenhänge in solchen Systemen spielerisch erschließen. \nFür die Simulationen, die wir programmieren, ist keine vorherige Programmiererfahrung nötig und wir lernen auch, wie man Werkzeuge programmiert, um diese Systeme grafisch zu analysieren. Wir benutzen in diesem Kurs die visuelle Programmiersprache Squeak/Etoys und ihre Werkzeuge zum Simulieren und Animieren von Systemen mit vielen Teilnehmern.\u003cbr\u003e\nDer Kurs richtet sich an Jugendliche ab 12 Jahren.\u003c/p\u003e\n\n\u003cp\u003eFolge uns auf Twitter: \u003ca href=\"https://twitter.com/openHPI\"\u003e@openHPI\u003c/a\u003e\u003cbr\u003e\nBesuche uns auf \u003ca href=\"https://www.facebook.com/OpenHPI/\"\u003eFacebook\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eWeitere Video Lectures findest du unter \u003ca href=\"http://www.tele-task.de/\"\u003ewww.tele-task.de.\u003c/a\u003e\u003c/p\u003e\n","image":"https://open.hpi.de/files/c9c9a2e6-95f8-4eec-ae15-0c21be425e80?name=","next_events":[],"language":"de","categories":["Programming","openHPI Junior"],"status":"archive"},{"id":"0bbaab26-7ef0-4783-b416-e28620a2503f","title":"IT-Recht für Software-Entwickler - 9 Themen, die Sie kennen sollten","url":"https://open.hpi.de/courses/0bbaab26-7ef0-4783-b416-e28620a2503f","start_date":"2016-09-14T08:00:00.000+00:00","end_date":"2016-10-31T22:00:00.000+00:00","teacher":"Dr. Brandi-Dohrn, Prof. Czychowski","code":"it-recht2016","abstract":"Sie sind Software-Ingenieur, Gründer oder Unternehmer eines IT-Unternehmens. Ihnen begegnen verschiedene rechtliche Themen. Die wichtigsten aus den Bereichen Verträge, Urheberrechte, Markenrecht, Patentrechte, Datenschutz, aber auch einige Bezüge zu Fragen bei Unternehmensverkäufen werden Ihnen in diesem 4-wöchigen Kurs von zwei anerkannten spezialisierten Rechtsanwälten auf diesem Gebiet nähergebracht.","description":"\u003cp\u003eSie sind Software-Ingenieur, Gründer oder Unternehmer eines IT-Unternehmens. Ihnen begegnen verschiedene rechtliche Themen. Die wichtigsten aus den Bereichen Verträge, Urheberrechte, Markenrecht, Patentrechte, Datenschutz, aber auch einige Bezüge zu Fragen bei Unternehmensverkäufen werden Ihnen in diesem 4-wöchigen Kurs von zwei anerkannten spezialisierten Rechtsanwälten auf diesem Gebiet nähergebracht.\u003c/p\u003e\n\n\u003ch4\u003eFür wen ist der Kurs gedacht?\u003c/h4\u003e\n\n\u003cp\u003eDas Angebot richtet sich insbesondere an Software-Ingenieure sowie Leiter und Gründer von IT-Unternehmen. Generell ist der Kurs offen für alle, die sich für das Thema interessieren. Vorkenntnisse werden keine erwartet. Pro Kurswoche ist mit einem Arbeitsaufwand von circa drei Stunden zu rechnen, um bereitgestellte Videos, Selbsttest-Aufgaben und bewertete Hausaufgaben zu bearbeiten. Für die erfolgreiche Kursteilnahme erhalten die Teilnehmer ein Zeugnis des Hasso-Plattner-Instituts.\u003c/p\u003e\n","image":"https://open.hpi.de/files/c2233af6-5452-4591-ac7e-a399267bda6c?name=","next_events":[],"language":"de","categories":[],"status":"archive"},{"id":"7793dd60-9a2f-4f01-828a-0dce340d8acd","title":"Wie funktioniert das Internet?","url":"https://open.hpi.de/courses/7793dd60-9a2f-4f01-828a-0dce340d8acd","start_date":"2016-09-05T08:00:00.000+00:00","end_date":"2016-10-31T23:30:00.000+00:00","teacher":"Prof. Dr. Christoph Meinel","code":"internetworking2016","abstract":"Aus unserem täglichen Leben ist das Internet nicht mehr wegzudenken. Wir nutzen das World Wide Web, um an Informationen zu gelangen, tauschen uns über soziale Netzwerke wie Facebook und Twitter aus, nutzen E-Mail und greifen auch innerhalb eines Unternehmens, in abgeschirmten Intranets auf die Internettechnologien zu. In diesem Kurs lernen Sie, auf welchen technologischen Grundlagen das weltumspannende Internet arbeitet. Dabei werden zuerst die Funktionsprinzipien und Technologien der lokalen Netzwerke (LANs) und der Weitverkehrsnetzwerke (WANs) erläutert. Anschließend werden das dem Internet zugrunde liegende TCP/IP-Referenzmodell sowie dessen Protokolle und zahlreichen Anwendungen allgemeinverständlich dargestellt. Der Teilnehmer gewinnt in diesem Kurs einen tiefgehenden Einblick in die komplexe Welt der Internet-Technologien.","description":"\u003cp\u003eAus unserem täglichen Leben ist das Internet nicht mehr wegzudenken. Wir nutzen das World Wide Web, um an Informationen zu gelangen, tauschen uns über soziale Netzwerke wie Facebook und Twitter aus, nutzen E-Mail und greifen auch innerhalb eines Unternehmens, in abgeschirmten Intranets auf die Internettechnologien zu. In diesem Kurs lernen Sie, auf welchen technologischen Grundlagen das weltumspannende Internet arbeitet. Dabei werden zuerst die Funktionsprinzipien und Technologien der lokalen Netzwerke (LANs) und der Weitverkehrsnetzwerke (WANs) erläutert. Anschließend werden das dem Internet zugrunde liegende TCP/IP-Referenzmodell sowie dessen Protokolle und zahlreichen Anwendungen allgemeinverständlich dargestellt. Der Teilnehmer gewinnt in diesem Kurs einen tiefgehenden Einblick in die komplexe Welt der Internet-Technologien.\u003c/p\u003e\n\n\u003cp\u003eFür die Kursteilnahme sollten Sie, abhängig von Ihrem Vorwissen, 3-6 Stunden pro Woche Zeit einplanen. Die geschätzte Zeit beinhaltet die Beschäftigung mit den bereitgestellten Lernmaterialien und Selbstests. Zusätzlich ist jede Woche eine benotete Hausaufgabe mit einer Bearbeitungszeit von 60 Minuten angesetzt. Der Arbeitsaufwand dieses Kurses entspricht 2 ECTS Punkten \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eNeu - jetzt buchbar:\u003c/strong\u003e \n\u0026lt;div style=\u0026quot;display: inline-block; overflow: hidden; height: 32px; line-height: 26px; font-size: 1.1rem; font-weight: bold; white-space: nowrap; transition: all .1s; background-color: #de6212; padding: 3px 5px;\u0026quot;\u0026gt;\n\u0026lt;a href=\u0026quot;/pages/document_types#qualifiziertes-zertifikat\u0026quot; style=\u0026quot;padding: 10px 5px; line-height: 26px; color: #ffffff\u0026quot;\u0026gt;Qualifizierte Zertifikate\u0026lt;/a\u0026gt;\u0026lt;/div\u0026gt;  \u003c/p\u003e\n\n\u003cp\u003eFolgen Sie uns auf Twitter: \u003ca href=\"https://twitter.com/openHPI\"\u003e@openHPI\u003c/a\u003e\u003cbr\u003e\nBesuchen Sie uns auf Facebook: \u003ca href=\"https://www.facebook.com/OpenHPI/\"\u003ehttps://www.facebook.com/OpenHPI\u003c/a\u003e  \u003c/p\u003e\n\n\u003cp\u003eWeitere Video Lectures finden Sie unter \u003ca href=\"http://www.tele-task.de/\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/4772d461-8f6b-45f2-b204-412bc1caa77a?name=","next_events":[],"language":"de","categories":["IT Basic Knowledge","IT Security"],"status":"archive"},{"id":"b8fc166f-5cd5-45ad-ae26-f5b5cad77130","title":"Wie designe ich meine eigene Homepage?","url":"https://open.hpi.de/courses/b8fc166f-5cd5-45ad-ae26-f5b5cad77130","start_date":"2016-07-06T00:00:00.000+00:00","end_date":"2016-08-17T00:00:00.000+00:00","teacher":"Lisa Ihde, Amadeus Glöckner, Florian Schmidt","code":"homepage2016","abstract":"Du bist ein Weltenbummler und möchtest deine Erfahrungen und Fotos auf einer eigenen Homepage teilen? Du informierst dich in Fashionblogs über die neuesten Trends und überlegst in einem eigenen Blog deine persönlichen Lieblingsstücke zu präsentieren? Oder hast du ein anderes cooles Hobby und würdest gerne alle Infos dazu auf einer eigenen Webseite zusammenstellen?  \r\nHat eure Klasse schon eine eigene Homepage, auf der ihr auf einen Blick seht, was in den nächsten Wochen so ansteht und was auf Klassenfahrt nicht fehlen darf? Nein? In diesem 2-wöchigen Workshop lernst du von Lisa, einer Studentin des Hasso-Plattner-Instituts, wie du in wenigen Schritten zu deiner eigenen Homepage gelangst und was du dabei hinsichtlich Urheberrechten, Bild- und Farbzusammenstellung beachten solltest. Außerdem erfährst du, woher du dir witzige Icons holen und wie du sogar eigene Icons, ein eigenes Logo und andere graphische Elemente designen kannst. ","description":"\u003cp\u003eDu bist ein Weltenbummler und möchtest deine Erfahrungen und Fotos auf einer eigenen Homepage teilen? Du informierst dich in Fashionblogs über die neuesten Trends und überlegst in einem eigenen Blog deine persönlichen Lieblingsstücke zu präsentieren? Oder hast du ein anderes cooles Hobby und würdest gerne alle Infos dazu auf einer eigenen Webseite zusammenstellen?\u003cbr\u003e\nHat eure Klasse schon eine eigene Homepage, auf der ihr auf einen Blick seht, was in den nächsten Wochen so ansteht und was auf Klassenfahrt nicht fehlen darf? Nein? In diesem 2-wöchigen Workshop lernst du von Lisa, einer Studentin des Hasso-Plattner-Instituts, wie du in wenigen Schritten zu deiner eigenen Homepage gelangst und was du dabei hinsichtlich Urheberrechten, Bild- und Farbzusammenstellung beachten solltest. Außerdem erfährst du, woher du dir witzige Icons holen und wie du sogar eigene Icons, ein eigenes Logo und andere graphische Elemente designen kannst. \u003c/p\u003e\n","image":"https://open.hpi.de/files/5e772798-7219-4fa2-b438-8250fb27ace3?name=","next_events":[],"language":"de","categories":["openHPI Junior"],"status":"archive"},{"id":"93efab03-bae3-46ed-bb7b-2f1b8af7e72d","title":"网络互联技术（2016）","url":"https://open.hpi.de/courses/93efab03-bae3-46ed-bb7b-2f1b8af7e72d","start_date":"2016-06-06T09:00:00.000+00:00","end_date":"2016-07-25T09:00:00.000+00:00","teacher":"Prof. Dr. Christoph Meinel","code":"internetworking2016-cn","abstract":"您有没有想过一天之中你有多少时间都在使用互联网？不管是在线购书、订票、看新闻或者写一封电子邮件都和网络息息相关，没有网络的生活已经变得无法想象。了解网络是如何工作怎么能说不是一件奇妙的事情呢？这门课程将为您介绍这个全球性网络的基础技术。您能学到基于局域网(LAN)和广域网(WAN)的功能和技术进行的数据传输的物理基础。此后您将学习TCP/IP参考模型——互联网的“心脏”，以及TCP/IP协议和其众多的应用。 通过这门课程所有参与者都能对网络技术这个复杂世界有个全面的了解。与此同时，您也将获得足够的知识以揭开互联网神秘的面纱。","description":"\u003cp\u003e授课人：克里斯托弗·梅内尔教授（Prof. Dr. Christoph Meinel）\u003c/p\u003e\n\n\u003cp\u003e您有没有想过一天之中你有多少时间都在使用互联网？不管是在线购书、订票、看新闻或者写一封电子邮件都和网络息息相关，没有网络的生活已经变得无法想象。了解网络是如何工作怎么能说不是一件奇妙的事情呢？这门课程将为您介绍这个全球性网络的基础技术。您能学到基于局域网(LAN)和广域网(WAN)的功能和技术进行的数据传输的物理基础。此后您将学习TCP/IP参考模型——互联网的“心脏”，以及TCP/IP协议和其众多的应用。 通过这门课程所有参与者都能对网络技术这个复杂世界有个全面的了解。与此同时，您也将获得足够的知识以揭开互联网神秘的面纱。\u003c/p\u003e\n\n\u003ch3\u003e课程内容\u003c/h3\u003e\n\n\u003chr\u003e\n\n\u003ch3\u003e第一周：简介:\u003c/h3\u003e\n\n\u003cp\u003e庞大的互联网，它到底有多复杂？\u003c/p\u003e\n\n\u003ch3\u003e第二周：网络技术:\u003c/h3\u003e\n\n\u003cp\u003e如何通过光电信号将消息从一台计算机传输到一墙之隔或者地球另一端的计算机上?\u003c/p\u003e\n\n\u003ch3\u003e第三周：通过IPv4进行网络互联:\u003c/h3\u003e\n\n\u003cp\u003e互联网由大量基于不同技术构建的单个网络互联而成，一个数据包究竟是如何在这样复杂的结构中找到正确的传输路径的？\u003c/p\u003e\n\n\u003ch3\u003e第四周：新的互联网协议——IPv6:\u003c/h3\u003e\n\n\u003cp\u003e在不久的将来，如何使得智能手机、家用电器以及汽车等产品通过互联网而相互连接起来？\u003c/p\u003e\n\n\u003ch3\u003e第五周：传输协议TCP和UDP:\u003c/h3\u003e\n\n\u003cp\u003e谁来保证我的数据能够完整而正确的穿过复杂的网络环境从而到达目的地？\u003c/p\u003e\n\n\u003ch3\u003e第六周：互联网应用:\u003c/h3\u003e\n\n\u003cp\u003e发送电子邮件或者在线传输视频，需要哪些必要的技术？\u003c/p\u003e\n\n\u003ch3\u003e结课考试:\u003c/h3\u003e\n\n\u003cp\u003e您在本课程中学到的全部知识将在结课考试中得到检验\u003c/p\u003e\n","image":"https://open.hpi.de/files/68a61ce8-5271-4c85-b03d-ba25910b2c80?name=","next_events":[],"language":"cn","categories":[],"status":"archive"},{"id":"162a61a2-8c63-45bd-9e5a-7a54a6957751","title":"Embedded Smart Home","url":"https://open.hpi.de/courses/162a61a2-8c63-45bd-9e5a-7a54a6957751","start_date":"2016-06-06T08:00:00.000+00:00","end_date":"2016-07-10T12:00:00.000+00:00","teacher":"Jan Renz, Martin Malchow, Matthias Bauer","code":"smarthome2016","abstract":"Herzlich Willkommen zum interaktiven Kurs „Embedded Smart Home“. Wir freuen uns, Sie in die Welt des Smart Home zu entführen. Während des Kurses bekommen Sie Einblicke in die Umsetzung eines Smart Home Projekts auf Basis eines Raspberry Pi und unter Nutzung von Sensoren, Aktuatoren und Displays. Um für die Programmierung gewappnet zu sein, können Sie Ihr Wissen aus dem zurückliegenden Python Kurs (\"Spielend Programmieren lernen\") nutzen und vertiefen. Wer diesen Kurs noch nicht besucht hat, kann dies auch jetzt noch im Archivmodus machen.  \r\nDie Programmieraufgaben können auf einem von uns über die Lernplatform zur Verfügung gestellten Gerät durchgeführt werden. Wer möchte kann aber auch ein eigenes Gerät nutzen. Eine Einkaufsempfehlung für ein Starterpaket mit dem Raspberry Pi und allen nötigen Bauteilen und Sensoren steht zur Verfügung. Somit können Sie das Projekt, an dem wir arbeiten, auch zu Hause implementieren und selber nutzen.  \r\nWir werden auf dem Raspberry Pi die Linux-Distribution Raspian benutzen und für die Programmieraufgaben Python verwenden.  \r\nUm den Kurs erfolgreich abzuschließen sind beide Varianten geeignet und Sie können selbst entscheiden, welche Möglichkeit Sie bevorzugen.\r\n","description":"\u003cp\u003eHerzlich Willkommen zum interaktiven Kurs „Embedded Smart Home“. Wir freuen uns, Sie in die Welt des Smart Home zu entführen. Während des Kurses bekommen Sie Einblicke in die Umsetzung eines Smart Home Projekts auf Basis eines Raspberry Pi und unter Nutzung von Sensoren, Aktuatoren und Displays. Um für die Programmierung gewappnet zu sein, können Sie Ihr Wissen aus dem zurückliegenden Python Kurs (\u0026quot;Spielend Programmieren lernen\u0026quot;) nutzen und vertiefen. Wer diesen Kurs noch nicht besucht hat, kann dies auch jetzt noch im Archivmodus machen.\u003cbr\u003e\nWir werden auf dem Raspberry Pi die Linux-Distribution \u003ca href=\"https://www.raspian.org/\"\u003eRaspian\u003c/a\u003e benutzen und für die Programmieraufgaben \u003ca href=\"https://www.python.org/\"\u003ePython\u003c/a\u003e verwenden.\u003cbr\u003e\nDie Programmieraufgaben können auf einem von uns über die Lernplatform zur Verfügung gestellten Gerät durchgeführt werden. Wer möchte kann aber auch ein eigenes Gerät nutzen. Um den Kurs erfolgreich abzuschließen sind beide Varianten geeignet und Sie können selbst entscheiden, welche Möglichkeit Sie bevorzugen.  \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eKauf und Einrichten eines eigenen Raspberry Pis\u003c/strong\u003e\u003cbr\u003e\nFalls Sie sich für den Kauf eines eigenen Raspberry Pis entscheiden, um das Projekt auch zuhause nachbauen zu können, können Sie zwischen 2 Varianten wählen. Da es auf \u003ca href=\"https://www.conrad.de/\"\u003eConrad.de\u003c/a\u003e die Sets nicht mehr gibt finden Sie nachfolgend die Conrad-Artikelnummern der Einzelartikel. In den Artikel sind enthalten zwei Temperatursensoren, ein Feuchtigkeitssensor, ein LCD-Display, Taster, LEDs, ein Fenstersensor, die entsprechenden elektrischen Bauteile, eine Steckplatine und Verbindungskabel.  Die Steckplatine und Verbindungskabel sind optional, wenn die Platine zum Selberlöten der Bauteile ohne Steckplatine weiter unten verwendet werden soll. Dieses Set ist geeignet für alle, die bereits einen Raspberry Pi B+, 2 oder 3 besitzen. Alle anderen bestellen zusätzlich noch das Raspberry Pi 3 mit der Bestellnummer 1419716 und die 8GB Speicherkarte mit der Bestellnummer 419769 mit. \nDie Bauteile und Bestellnummern (in Klammern) für conrad.de sind wie folgt:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e1x LCD-Modul 16x2 (183045)\u003c/li\u003e\n\u003cli\u003e1x LED bedrahtet Grün-Gelb Rund 3 mm (156228)\u003c/li\u003e\n\u003cli\u003e1x LED bedrahtet Rot Rund 5 mm (184543)\u003c/li\u003e\n\u003cli\u003e2x Temperatursensor LM335Z (176656)\u003c/li\u003e\n\u003cli\u003e1x Feuchtesensor-Modul HMZ-333A1 (1170518)\u003c/li\u003e\n\u003cli\u003e1x Betätigermagnet Cherry Switches AS201801 (276116)\u003c/li\u003e\n\u003cli\u003e1x Reedschalter mit Kabel MP201801 (276124)\u003c/li\u003e\n\u003cli\u003e1x Elektrolyt-Kondensator radial bedrahtet 2.5 mm (445563)\u003c/li\u003e\n\u003cli\u003e1x Analog-Digital-Wandler (ADC) Microchip MCP3008-I/P Extern PDIP-16 (651456)\u003c/li\u003e\n\u003cli\u003e2x Drucktaster 24 V/DC 0.05 A 1 x Aus/(Ein) (701749)\u003c/li\u003e\n\u003cli\u003e2x Stiftleiste Gerade RM 2,54 943-13-010-00 (737371)\u003c/li\u003e\n\u003cli\u003e4x Metallschicht-Widerstand MOR01SJ0500A10 50 Ohm (1289844)\u003c/li\u003e\n\u003cli\u003e4x Metallschicht-Widerstand MF0207FTE52-1K 1 kOhm (1417606)\u003c/li\u003e\n\u003cli\u003e2x Metallschicht-Widerstand MOR01SJ0472A10 4,7 kOhm (1289885)\u003c/li\u003e\n\u003cli\u003e2x Metallschicht-Widerstand MOR01SJ0103A10 10 kOhm (1289892)\u003c/li\u003e\n\u003cli\u003e1x Litze LiY 1 x 0.14 mm² Grün-Gelb (605569)\u003c/li\u003e\n\u003cli\u003e1x Steckplatine Transparent (526819) (optional, wenn unten beschriebene Platine genutzt werden soll)\u003c/li\u003e\n\u003cli\u003e2x Raspberry Pi® Verbindungskabel (1290220) (optional, wenn unten beschriebene Platine genutzt werden soll)\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eFür den Betrieb des Raspberry Pis benötigen Sie zusätzlich als Stromquelle ein Micro-USB-Kabel (entspricht Ladegeräten von Android Smartphones) mit mind. 1A. Wenn Sie sich unsicher sind, ob die Stromstärke ausreicht oder Sie kein Micro-USB-Kabel haben, kann dies zum Beispiel bei conrad.de unter der Bestellnummer 1341280 mitbestellt werden.\u003cbr\u003e\nZusätzlich benötigen Sie für die Anzeige, wie auch für einen normalen Computer typisch, Maus (USB), Tastatur (USB) und Bildschirm (HDMI). Beim Bildschirm ist zu beachten, dass dieser über den HDMI-Anschluss mit Daten versorgt wird. Daher sind, wenn nicht bereits vorhanden, ein HDMI-Kabel und unter Umständen entsprechende Adapter für den Bildschirm notwendig. Wenn der Raspberry Pi eingerichtet ist und die im Kurs entwickelte Software darauf ausgeführt wird, ist der Anschluss von Tastatur, Maus und Bildschirm nicht mehr notwendig.  \u003c/p\u003e\n\n\u003cp\u003eWenn sich noch jemand für den Kauf der Platine zum Selberlöten der Bauteile interessiert. Diese kann im folgendem Shop erworben werden ... \u003ca href=\"https://supr.com/embedded-smart-home/\"\u003ehttps://supr.com/embedded-smart-home/\u003c/a\u003e\u003c/p\u003e\n\n\u003cp\u003eWir haben Ihnen unter \u0026quot;Lernmaterial\u0026quot; ein paar Videos zur Vorbereitung bereitgestellt. Alle, die ein eigenes Raspberry Pi besitzen, können sich \u003ca href=\"https://open.hpi.de/courses/smarthome2016/items/3m5ID8d8askj8YAhG21RKq\"\u003ehier\u003c/a\u003e wertvolle Tipps zur Installation und zum Anschließen der verschiedenen Module und Sensoren holen. \u003c/p\u003e\n","image":"https://open.hpi.de/files/c2464143-e9ba-4e53-b71f-454211c2cc22?name=","next_events":[],"language":"de","categories":["Programming"],"status":"archive"},{"id":"685b5e06-90ee-42ae-94cd-7b62df8e76db","title":"Java Workshop - Einführung in die Testgetriebene Entwicklung mit JUnit","url":"https://open.hpi.de/courses/685b5e06-90ee-42ae-94cd-7b62df8e76db","start_date":"2016-05-02T08:00:00.000+00:00","end_date":"2016-06-01T23:30:00.000+00:00","teacher":"Thomas Staubitz, Ralf Teusner","code":"javawork2016","abstract":"Probieren ist gut, testen ist besser. In der Regel weiss man, was ein Programm tun soll bevor man es schreibt.\r\nWarum nicht gleich die Bedingungen nach denen es funktionieren soll in Code fassen, der überprüft ob die Vorgaben auch erfüllt werden?\r\n\r\nUm dies zu tun gibt es eine Reihe spezialisierter Frameworks die das auf verschiedene Weisen sicher stellen. In diesem Workshop wollen wir uns auf das Unit Testing mit JUnit konzentrieren. Unter Unit Tests versteht man Tests die kleine abgeschlossene Code-Einheiten, wie z.B. Klassen oder Methoden auf korrekte Funktionalität prüfen.\r\n\r\nGrundkenntnisse der Objektorientierten Programmierung in Java und der Eclipse IDE werden vorausgesetzt. \r\nDer Kurs \"Java für Einsteiger\" sowie der \"Workshop Einführung in eine Java- Programmierumgebung (IDE)\", stehen im openHPI-Archiv zur Auffrischung der Java Grundkenntnisse zur Verfügung.\r\n","description":"\u003cp\u003eProbieren ist gut, testen ist besser. In der Regel weiss man, was ein Programm tun soll bevor man es schreibt.\nWarum nicht gleich die Bedingungen nach denen es funktionieren soll in Code fassen, der überprüft ob die Vorgaben auch erfüllt werden?\u003c/p\u003e\n\n\u003cp\u003eUm dies zu tun gibt es eine Reihe spezialisierter Frameworks die das auf verschiedene Weisen sicher stellen. In diesem Workshop wollen wir uns auf das Unit Testing mit JUnit konzentrieren. Unter Unit Tests versteht man Tests die kleine abgeschlossene Code-Einheiten, wie z.B. Klassen oder Methoden auf korrekte Funktionalität prüfen.\u003c/p\u003e\n\n\u003cp\u003eGrundkenntnisse der Objektorientierten Programmierung in Java und der Eclipse IDE werden vorausgesetzt. \nDer Kurs \u0026quot;Java für Einsteiger\u0026quot; sowie der \u0026quot;Workshop Einführung in eine Java- Programmierumgebung (IDE)\u0026quot;, stehen im openHPI-Archiv zur Auffrischung der Java Grundkenntnisse zur Verfügung.\u003c/p\u003e\n","image":"https://open.hpi.de/files/99a36000-c69e-4ef7-bc67-2660f2aca929?name=","next_events":[],"language":"de","categories":["Programming"],"status":"archive"},{"id":"dde02a76-c145-48f1-a065-3a77c8a19574","title":"Hands on Industrie 4.0","url":"https://open.hpi.de/courses/dde02a76-c145-48f1-a065-3a77c8a19574","start_date":"2016-04-25T08:00:00.000+00:00","end_date":"2016-05-30T23:30:00.000+00:00","teacher":"Prof. Dr. Henning Kagermann, Prof. Dr. Christoph Meinel","code":"industrie40-2016","abstract":"**Dieser Kurs wird auf mooc.house angeboten.**\r\n\r\nDas Internet der Dinge zieht in die Fabrik. Wir befinden uns am Beginn der vierten industriellen Revolution – Industrie 4.0. Sie wandelt nicht nur die Produktionslogik, sondern fordert auch die Geschäftsmodelle vieler deutscher Unternehmen heraus. Aus Wertschöpfungsketten werden Wertschöpfungsnetzwerke, intelligente Produkte werden zu Plattformen für innovative Dienstleistungen, Produktionsprozesse und Logistik können in Echtzeit optimiert werden. Die digital vernetzte Produktion soll Ressourcen schonen und Flexibilität zugunsten der Arbeitnehmer ermöglichen.  \r\nDoch wie können Unternehmen diesen Wandel mitgestalten?  Wie können  sie Ihr Know-how auch in der Cloud schützen, ihre Mitarbeiter mitnehmen und wie kann die schrittweise Einführung von Industrie 4.0-Technologien im Unternehmen gelingen?  \r\nIn unserem 5-wöchigen Kurs liefern Experten aus Unternehmen und Wissenschaft mögliche Antworten und Umsetzungsbeispiele. ","description":"\u003cp\u003eWir befinden uns am Beginn der vierten industriellen Revolution – Industrie 4.0. Das Internet der Dinge zieht in die Fabrik und wandelt unsere Art zu wirtschaften und zu arbeiten grundlegend.  Produkte steuern den Produktionsprozess aktiv mit, Produktionsprozesse und Logistik  können in Echtzeit optimiert werden.  LKWs wiegen beispielsweise ihre Transportlast und entscheiden allein, wann sie nachladen sollten, um Lieferengpässe zu vermeiden. Auch die Anforderungen an die Beschäftigten ändern sich: Sie nehmen stärker koordinierende Aufgaben wahr und interagieren mit intelligenten Assistenzsystemen und Robotern.\u003cbr\u003e\nUnd der Wandel macht nicht an den Fabrikzäunen halt. Die Digitalisierung verwandelt praktisch jeden Gegenstand, jedes Gerät und jede Maschine in einen Internetknotenpunkt, der mit anderen kommuniziert. Heute schon gibt es davon 15 Milliarden. Verlassen solche smarten Produkte die Fabriken, werden sie zur Grundlage neuer, datengetriebener Geschäftsmodelle.\nIndustrie 4.0 ist aber nicht nur ein industriepolitisches Thema, sondern adressiert auch ökologische und soziale Herausforderungen wie Ressourceneffizienz, Umweltschutz oder Urbanisierung.\nIndustrie 4.0 ist eine große Chance. Viele Unternehmen setzen bereits Industrie 4.0-Strategien um und heben die Optimierungspotenziale  für Ihre Produktionsprozesse. \nWas heißt Industrie 4.0 für die Beschäftigten, für die Arbeit von morgen? Wie gut sind Unternehmen auf die digitale Revolution vorbereitet? Welche neuen Sicherheitslücken ergeben sich in der vernetzten Produktion und welche Empfehlungen geben Experten, um sich zu schützen? \u003c/p\u003e\n\n\u003cp\u003eIn unserem 5-wöchigen Onlinekurs, einer Kooperation der Deutschen Akademie der Technikwissenschaften (acatech) und des Hasso-Plattner-Instituts, liefern herausragende Vertreter aus Wirtschaft und Wissenschaft die Antworten und beleuchten alle Aspekte der vierten industriellen Revolution.  \u003c/p\u003e\n\n\u003cp\u003eBitte beachten Sie: Dies ist ein externer Kurs. Um daran teilzunehmen, müssen Sie einen extra Account auf unserer Schwesterplattform mooc.house anlegen. Dafür benötigt werden lediglich ein Name und eine E-Mailadresse.\u003c/p\u003e\n","image":"https://open.hpi.de/files/bda3d8eb-9205-4525-bf65-b0c069261130?name=","next_events":[],"language":"de","categories":[],"status":"archive"},{"id":"fa6e42a0-7565-45e0-8abb-1a5c257f0a7e","title":"BPMN Meets DMN: Business Process and Decision Modeling","url":"https://open.hpi.de/courses/fa6e42a0-7565-45e0-8abb-1a5c257f0a7e","start_date":"2016-04-11T08:00:00.000+00:00","end_date":"2016-06-04T23:30:00.000+00:00","teacher":"Prof. Dr. Mathias Weske","code":"bpm2016","abstract":"This course introduces concepts of business process modeling using the Business Process Model and Notation (BPMN) industry standard. Participants will learn the elements of process models and their precise meaning. Based on a thorough understanding of business process models, the last part of the course covers decision models using the Decision Model and Notation (DMN). Decision models complement process models by representing concrete, operational decisions, both with their structure and their decision logics. The course centers around concepts and language to describe and analyze business processes and decisions. It does not cover methods on how to model, improve, monitor or implement business processes. Still, a deep understanding of business processes and decisions is a useful basis for these activities.","description":"\u003cp\u003eBusiness process models play a central role in describing, analyzing, improving, implementing, and monitoring business processes. They serve as a communication vehicle for professionals with different background and expertise, ranging from business administration, quality management, and organizational development to process improvement, systems architectures, and software development. \u003c/p\u003e\n\n\u003cp\u003eRecently, there is a strong focus on operational decisions in business processes, since they influence the process flow, its performance and quality. Decision models complement process models by representing concrete, operational decisions, both with their structure and their decision logics.\u003c/p\u003e\n\n\u003cp\u003eThis online course introduces concepts of business process modeling using the Business Process Model and Notation (BPMN). Participants will learn the elements of process models and their precise meaning. Based on a thorough understanding of business process models, the last part of the course covers decision models using the recent standard Decision Model and Notation (DMN). \u003c/p\u003e\n\n\u003cp\u003eThe course covers concepts to describe and analyze business processes and decisions. It does not cover methods on how to model, improve, monitor or implement business processes. Still, a deep understanding of business processes and decisions is a useful basis for these activities.\u003c/p\u003e\n\n\u003cp\u003eOutline\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eWeek 1: Introduction to Business Process Management\u003c/li\u003e\n\u003cli\u003eWeek 2: Basic Business Process Modeling\u003c/li\u003e\n\u003cli\u003eWeek 3: Analyzing the Behavior of Process Models\u003c/li\u003e\n\u003cli\u003eWeek 4: Advanced Business Process Modeling\u003c/li\u003e\n\u003cli\u003eWeek 5: Data in Business Process Models\u003c/li\u003e\n\u003cli\u003eWeek 6: Business Decision Modeling \u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eThe course is conducted by Prof. Dr. Weske and his team. The teaching team is complemented by HPI staff members and Phd students Luise Pufahl and Kimon Batoulis as well as the HPI students Julian Weise and Maarten Oestreich.\u003c/p\u003e\n\n\u003cp\u003eJoin openHPI\u0026#39;s official Twitter Feed: \u003ca href=\"https://twitter.com/openHPI\"\u003e@openHPI\u003c/a\u003e\u003cbr\u003e\nYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de/\"\u003ewww.tele-task.de\u003c/a\u003e .\u003c/p\u003e\n\n\u003cp\u003eThe previous version of this course without decision modeling is available here:\n\u003ca href=\"https://open.hpi.de/courses/bpm2013\"\u003eBusiness Process Modeling and Analysis (2013)\u003c/a\u003e, October 27, 2013 to January 07, 2014 \u003c/p\u003e\n","image":"https://open.hpi.de/files/633be95b-3a4f-4cb4-a7b2-fc159eb4f8db?name=","next_events":[],"language":"en","categories":["IT Technical Principles"],"status":"archive"},{"id":"39a5e1df-6bf8-474f-8800-81225829c49e","title":"Unternehmensgründung im IT-Bereich - Wie gründe ich erfolgreich ein IT-Startup?","url":"https://open.hpi.de/courses/39a5e1df-6bf8-474f-8800-81225829c49e","start_date":"2016-04-04T08:00:00.000+00:00","end_date":"2016-04-30T23:30:00.000+00:00","teacher":"Manuel Effenberg","code":"startup2016","abstract":"Die Digitalisierung treibt die Gründung neuer Unternehmen im IT-Sektor voran. Darüber hinaus gibt der Einsatz neuer IT-Technologien potenziellen Entrepreneuren die Möglichkeit, ihre Geschäftsideen relativ schnell zu testen, um marktfähige Softwareprodukte zu entwickeln.  \r\nIn diesem zweiwöchigen Workshop möchten wir Ihnen einen praxisorientierten Einblick in die Herausforderungen und Fallstricke bei der Gründung eines IT-Startups geben. Was ist im Vorfeld, z.B. bei der Teamzusammenstellung zu beachten? Welche Methoden sind hilfreich, um das Geschäftsmodell darzustellen und weiterzuentwickeln? Wie positioniere ich ein innovatives IT-Produkt im Markt? Welche Finanzierungsinstrumente gibt es? Diese und viele weitere Fragen werden in unserem openHPI-Kurs besprochen, um Ihnen ein „Toolkit“ zur erfolgreichen Gründung eines IT-Unternehmen zu geben.\r\n \r\n","description":"\u003cp\u003eDie Digitalisierung bürgt eine Vielzahl von Chancen, auch für die Gründung neuer Unternehmen. So sind immer mehr neue Geschäftsmodelle im IT-Sektor zu beobachten, wie z. B. Cloud Computing Lösungen und Plattformen zum Austausch von physischen Gütern und Serviceangeboten, welche bestehende Anbieter und Märkte verdrängen. Der Einsatz neuer IT-Technologien gibt einer Vielzahl potenzieller Gründer zudem die Möglichkeit heutzutage relativ kostenarm ihre Geschäftsidee zu testen und marktfähige Produkte zu entwickeln.\u003cbr\u003e\nVor diesem Hintergrund lernen Sie in diesem Workshop zuerst, was es heißt „Entrepreneur“ zu sein und welche Dinge sie schon im Vorfeld beim Teamaufbau und der Suche nach einer Geschäftsidee beachten sollten. Anschließend erläutern wir, warum es wichtig ist, von Beginn an ein Geschäftsmodell zu verfolgen und stellen Methoden zur Erfassung und Weiterentwicklung ihres Geschäftsmodells dar. Danach betrachten wir die Aspekte einer kundenfokussierten Produktentwicklung und widmen uns der Frage, was es heißt ein innovatives IT-Produkt am Markt einzuführen und erfolgreich, auch in späteren Phasen, zu positionieren. Abschließend gehen wir auf das Thema Finanzierung ein und analysieren diverse Finanzierungsinstrumente in der Gründungsphase.\u003cbr\u003e\nDas Ziel ist es, dem Teilnehmer einen praxisorientierten Einblick in die Herausforderungen und Fallstricke bei der Gründung eines IT-Start-ups zu geben – wir wollen dem Teilnehmer nicht die wirtschaftstheoretischen Hintergründe erläutern, sondern ihm das „Toolkit“ in die Hand geben, um erfolgreich ein IT-Start-up zu gründen.\u003c/p\u003e\n","image":"https://open.hpi.de/files/6291ab1b-43d3-40bb-994e-97f2df6ca0d9?name=","next_events":[],"language":"de","categories":["IT Basic Knowledge"],"status":"archive"},{"id":"9116a19d-7cba-4412-b35a-6d6dabc29c9a","title":"Sicherheit im Internet","url":"https://open.hpi.de/courses/9116a19d-7cba-4412-b35a-6d6dabc29c9a","start_date":"2016-02-08T08:00:00.000+00:00","end_date":"2016-04-08T23:30:00.000+00:00","teacher":"Prof. Dr. Christoph Meinel","code":"intsec2016","abstract":"Hackern gelingt es immer wieder, Passwörter zu stehlen, auf sensible Firmen- und Userdaten zuzugreifen und somit schlimmstenfalls ganze Unternehmen lahmzulegen. So vielfältig die Möglichkeiten sind, die das Internet seinen Nutzern bietet, so vielfältig sind auch die Angriffspunkte und potenziellen Gefahren, die vom Internet ausgehen und vielen Menschen noch nicht richtig bewusst sind. In diesem openHPI-Kurs lernen Sie die Grundbegriffe der Internetsicherheit kennen. Warum ist das Internet in seinem Grunddesign unsicher? Welches sind die Schwachstellen des Internets und wie werden diese von Cyberkriminellen ausgenutzt? Diese Fragen werden unter anderem in diesem Kurs beantwortet. Gleichzeitig erhalten Sie einige Tipps, wie Sie sich vor solchen Angriffen schützen können.","description":"\u003cp\u003eHackern gelingt es immer wieder, Passwörter zu stehlen, auf sensible Firmen- und Userdaten zuzugreifen und somit schlimmstenfalls ganze Unternehmen lahmzulegen. So vielfältig die Möglichkeiten sind, die das Internet seinen Nutzern bietet, so vielfältig sind auch die Angriffspunkte und potenziellen Gefahren, die vom Internet ausgehen und vielen Menschen noch nicht richtig bewusst sind. In diesem openHPI-Kurs lernen Sie die Grundbegriffe der Internetsicherheit kennen. Warum ist das Internet in seinem Grunddesign unsicher? Welches sind die Schwachstellen des Internets und wie werden diese von Cyberkriminellen ausgenutzt? Diese Fragen werden unter anderem in diesem Kurs beantwortet. Gleichzeitig erhalten Sie einige Tipps, wie Sie sich vor solchen Angriffen schützen können.\u003c/p\u003e\n\n\u003cp\u003eFolgen Sie uns auf Twitter: \u003ca href=\"https://twitter.com/openHPI\"\u003e@openHPI\u003c/a\u003e\u003cbr\u003e\nBesuchen Sie uns auf \u003ca href=\"https://www.facebook.com/OpenHPI/\"\u003eFacebook\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eWeitere Video Lectures finden Sie unter \u003ca href=\"http://www.tele-task.de/\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eWeitere online Sicherheitsdiente unter \u003ca href=\"https://sec.hpi.de/\"\u003esec.hpi.de\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eKursbildquelle: © James Thew / \u003ca href=\"https://de.fotolia.com/id/64117399\"\u003eFotolia\u003c/a\u003e\u003c/p\u003e\n","image":"https://open.hpi.de/files/13eb859c-4fd2-4d7d-85b2-bb009a8cb0ae?name=","next_events":[],"language":"de","categories":["IT Basic Knowledge","IT Security"],"status":"archive"},{"id":"12500848-0925-4deb-880c-d1b4cff88713","title":"Social Media - What No One has Told You about Privacy","url":"https://open.hpi.de/courses/12500848-0925-4deb-880c-d1b4cff88713","start_date":"2016-01-18T08:00:00.000+00:00","end_date":"2016-02-15T23:30:00.000+00:00","teacher":"Dr. Anne Kayem","code":"ws-privacy2016","abstract":"In this 2 week workshop we discuss the emergence of social media, how the concept gained popularity and has now become the axle in collaborative communication on the Internet. We follow this with a presentation of basic approaches that you can use to protect your data and more importantly your privacy on these platforms. Everyone knows the odd feeling of discomfort when having added someone you actually don't know very well to yours friends' list or to the wrong category within your contacts. The participants will learn in this openHPI course that privacy is still a concern also for users who do not actively use the Internet.","description":"\u003cp\u003eIn this workshop we discuss the emergence of social media, how the concept gained popularity and has now become the axle in collaborative communication on the Internet. We follow this with a presentation of basic approaches that you can use to protect your data and more importantly your privacy on these platforms.\u003cbr\u003e\nHave you ever accepted a friendship request from the guy or girl you met at the corner store only to regret it the minute you clicked on “ACCEPT”? Or have you ever mistakenly allocated a “friend” to the wrong category and spent endless hours going through your list of 75,000 friends in order to find and reallocate your friend to the correct category?  If you have, then you probably know about the nagging feeling of discomfort that you try to ignore or comfort yourself by telling yourself that it does not matter. We discuss examples of cyber-attackers to illustrate to you that this feeling should be taken seriously. If you feel concerned that something is not quite right, it most likely is the case.\u003cbr\u003e\nFinally, we consider users like your Great Grandma who probably don’t use the Internet. If you have drifted away envying that peaceful time when social media did not exist, you could not be more mistaken. Privacy is still a concern for users who do not actively use the Internet!\u003c/p\u003e\n\n\u003cp\u003eJoin openHPI\u0026#39;s official Twitter Feed: \u003ca href=\"https://twitter.com/openHPI\"\u003e@openHPI\u003c/a\u003e\u003cbr\u003e\nYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de/\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/cc59b7cd-4daa-45ab-8a17-1a62e0b5f9ea?name=","next_events":[],"language":"en","categories":["IT Basic Knowledge","IT Security","Recent developments"],"status":"archive"},{"id":"c1556425-5449-4b05-97b3-42b38a39f6c5","title":"Spielend Programmieren lernen 2015!","url":"https://open.hpi.de/courses/c1556425-5449-4b05-97b3-42b38a39f6c5","start_date":"2015-11-09T08:00:00.000+00:00","end_date":"2015-12-15T22:30:00.000+00:00","teacher":"Prof. Dr. Martin v. Löwis","code":"pythonjunior2015","abstract":"Dieser vierwöchige Kurs richtet sich an Schüler und andere Interessierte, die schon immer in die Welt des Programmierens hineinschnuppern wollten. Auf spielerische Art und Weise wird anhand der Programmiersprache Python eine Einführung in die faszinierende Welt des Programmierens und der Informationstechnologie gegeben.","description":"\u003cp\u003eSo einfach war es noch nie die Grundlagen des Programmierens spielerisch zu erlernen. Um am Kurs teilzunehmen, braucht man keine besonderen Vorkenntnisse, nur einen Internetanschluss und einen Rechner. Auf dem Rechner muss keine spezielle Software installiert werden. Notwendig sind nur ein aktueller Browser und eine E-Mail-Adresse, mit der man sich auf openHPI anmelden kann.\u003c/p\u003e\n\n\u003cp\u003eAm Anfang des kostenlosen vierwöchigen Kurses stehen einfache Programmierübungen. Du lernst, eine virtuelle Schildkröte durch deine Programmierung zu steuern. In den darauffolgenden Wochen wirst du mit Schleifen und Funktionen vertraut gemacht, die dir ein grundlegendes Verständnis für die Struktur des Programmierens geben. Bei dem openHPI-Kurs wirst du Lernvideos schauen und im Quiz überprüfen, ob du alles verstanden hast. Direkt im Browser kannst du dann das gelernte Wissen anwenden und drauflos programmieren.\u003c/p\u003e\n\n\u003cp\u003eWenn Du einmal nicht weiter weißt, kannst du im Forum oder den Lerngruppen Unterstützung von anderen Kursteilnehmern finden. Bei erfolgreicher Teilnahme erhältst du nach Kursende ein openHPI-Zeugnis.\u003c/p\u003e\n\n\u003cp\u003eFolge uns auf Twitter: \u003ca href=\"https://twitter.com/openHPI\"\u003e@openHPI\u003c/a\u003e\u003cbr\u003e\nBesuche uns auf Facebook: \u003ca href=\"https://www.facebook.com/OpenHPI\"\u003ehttps://www.facebook.com/OpenHPI\u003c/a\u003e\u003c/p\u003e\n\n\u003cp\u003eWeitere Video Lectures findest du unter \u003ca href=\"http://www.tele-task.de/\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/fca875a9-d935-4b56-8080-5279b9ef9b54?name=","next_events":[],"language":"de","categories":["Programming","openHPI Junior"],"status":"archive"},{"id":"470e418f-232a-419a-a2d4-312e51d5f161","title":"Knowledge Engineering with Semantic Web Technologies 2015","url":"https://open.hpi.de/courses/470e418f-232a-419a-a2d4-312e51d5f161","start_date":"2015-11-02T08:00:00.000+00:00","end_date":"2016-01-02T23:30:00.000+00:00","teacher":"Dr. Harald Sack","code":"semanticweb2015","abstract":"The knowledge contained in the World Wide Web is available in interlinked documents written in natural language. To make use of this knowledge, technologies such as natural language processing, information retrieval, data and knowledge mining must be applied. Semantic Web technologies follow an alternative approach by complementing web documents with explicit semantics based on formal knowledge representations, such as e.g. ontologies.\r\nIn this MOOC, you will learn the fundamentals of Semantic Web technologies and how they are applied for knowledge representation in the World Wide Web. You will learn how to represent knowledge with ontologies and how to access and benefit from semantic data on the Web. Furthermore, you will also learn how to make use of Linked Data and the Web of Data, currently the most popular applications based on Semantic Web technologies.","description":"\u003cp\u003eThe web has become an object of our daily life and the amount of information in the web is ever growing. Besides plain texts, especially multimedia information such as graphics, audio or video have become a predominant part of the web\u0026#39;s information traffic. But, how can we find useful information within this huge information space? How can we make use of the knowledge contained in those web documents? Traditional search engines for example will reach the limits of their power, when it comes to understanding information content. The Semantic Web is an extension of the traditional web in the sense that information in the form of natural language text in the web will be complemented by its explicit semantics based on a formal knowledge representation. Thus, the meaning of information expressed in natural language can be accessed in an automated way and interpreted correctly, i.e. it can be ‘understood’ by machines.\u003c/p\u003e\n\n\u003cp\u003eSemantic Web technologies enable the explicit representation of knowledge and its further processing to deduce new knowledge from implicitly hidden knowledge. Thus, information access and information search will be more precise and more complete compared to today\u0026#39;s traditional information retrieval technology. Previously heterogeneous data can be mapped and combined based on common knowledge representation and schemata easily extended in a dynamic way.\u003c/p\u003e\n\n\u003cp\u003eIn this MOOC, you will learn the fundamentals of Semantic Web technologies and how they are applied for knowledge representation in the World Wide Web. You will learn how to represent knowledge with ontologies and how to access and benefit from semantic data on the Web. Furthermore, you will also learn how to make use of Linked Data and the Web of Data, currently the most popular applications based on Semantic Web technologies.\u003c/p\u003e\n\n\u003cp\u003eJoin openHPI\u0026#39;s official Twitter Feed: @openHPI\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eThis year\u0026#39;s course differs from the 2014 edition in the following way:\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003emore emphasis on knowledge engineering with practical examples\u003c/p\u003e\u003c/li\u003e\n\u003cli\u003e\u003cp\u003ethere are many EXTRA parts at the end of each lecture week covering additional and in depth topics. These parts marked with EXTRA are NOT GRADED and also not subject of the exams. They are not an \u0026#39;official\u0026#39; part of the course, but only a voluntary addendum to deepen your knowledge.   \u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003eRequirements for this course:\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003ea basic knowledge of the foundations of mathematical logics, i.e. propositional logics and first order logics \u003c/p\u003e\u003c/li\u003e\n\u003cli\u003e\u003cp\u003ea basic understanding of web technologies, such as URL, http, HTML, and XML-based technologies\u003c/p\u003e\u003c/li\u003e\n\u003cli\u003e\u003cp\u003ea basic knowledge of database technology such as, e.g. relational databases and SQL query language\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n","image":"https://open.hpi.de/files/f1d16619-9813-4d59-96b3-d84908929b23?name=","next_events":[],"language":"en","categories":["IT Technical Principles"],"status":"archive"},{"id":"3af21f5c-466a-4521-ad42-8392b2c909fc","title":"In-Memory Data Management 2015","url":"https://open.hpi.de/courses/3af21f5c-466a-4521-ad42-8392b2c909fc","start_date":"2015-09-07T08:00:00.000+00:00","end_date":"2015-11-02T23:30:00.000+00:00","teacher":"Prof. Hasso Plattner","code":"imdb2015","abstract":"The „In-Memory Data Management\" MOOC in 2015 is the fourth iteration of Prof. Hasso Plattner's successful introduction into the inner mechanics of this recent technology. It is a repetition of the 2014 course and builds on the same, revised material. The course  focuses on the management of enterprise data in column-oriented in-memory databases. Latest hardware and software trends led to the development of a new revolutionary database technology that enables flexible and lightning-fast analysis of massive amounts of enterprise data. ","description":"\u003cp\u003eThe „In-Memory Data Management\u0026quot; MOOC in 2015 is the fourth iteration of Prof. Hasso Plattner\u0026#39;s successful introduction into the inner mechanics of this recent technology. It is a repetition of the 2014 course and builds on the same, revised material. The course  focuses on the management of enterprise data in column-oriented in-memory databases. Latest hardware and software trends led to the development of a new revolutionary database technology that enables flexible and lightning-fast analysis of massive amounts of enterprise data. The basic concepts and design principles of this technology are explained in detail. Beyond that, the implications of the underlying design principles for future enterprise applications and their development are discussed. The MOOC will explain in detail the differences and advantages of an in-memory column-oriented database in contrast to traditional row-oriented disk-based storages. \u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003e        • Requirements for Modern Enterprise Computing, Enterprise Application Characteristics\n        • Hardware Trends, Columnar Storage vs. Row Storage\n        • Dictionary Encoding, Compression\n        • Scans, Selects, Deletes, Inserts, Updates\n        • Indices, Joins\n        • Applications\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eParticipants of this course will receive access to the extensive reading material accompanying the lectures.\u003c/p\u003e\n\n\u003cp\u003eYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e .\u003c/p\u003e\n","image":"https://open.hpi.de/files/3b39dcc6-e9f0-43df-b729-4cfab4b9300c?name=","next_events":[],"language":"en","categories":["Recent developments"],"status":"archive"},{"id":"0c6c5ad1-a770-4f16-81c3-536169f3cbd3","title":"Web Technologies","url":"https://open.hpi.de/courses/0c6c5ad1-a770-4f16-81c3-536169f3cbd3","start_date":"2015-06-01T08:00:00.000+00:00","end_date":"2015-07-22T23:30:00.000+00:00","teacher":"Prof. Dr. Christoph Meinel","code":"webtech2015","abstract":"WWW, the world wide web or shortly the web - really nothing more than an information service on the Internet – has changed our world by creating a whole new digital world that is closely intertwined with our real world, making reality what was previously unimaginable: communication across the world in seconds, watching movies on a smartphone, playing games or looking at photos with remote partners in distant continents, shopping or banking from your couch … In our MOOC on web technologies you will learn how it all works. ","description":"\u003cp\u003eWWW, the world wide web or shortly the web - really nothing more than an information service on the Internet – has changed our world by creating a whole new digital world that is closely intertwined with our real world, making reality what was previously unimaginable: communication across the world in seconds, watching movies on a smartphone, playing games or looking at photos with remote partners in distant continents, shopping or banking from your couch … In our MOOC on web technologies you will learn how it all works.\u003c/p\u003e\n\n\u003cp\u003eWe start off by introducing the underlying technologies of the web: URI, HTTP, HTML, CSS and XML. If this sounds cryptic, rest assured that you will soon become familiar with what it’s all about. We will then focus on web services and web programming technologies along with their practical application. And we will look at how search engines – our fast and reliable signposts in the digital world – actually work to find contents and services on the web. The course concludes with a look at cloud computing and how it is changing the way we will access computing power in the future.\u003c/p\u003e\n\n\u003cp\u003eHere’s what participants are saying about this course:\u003c/p\u003e\n\n\u003cp\u003eRalf: \u003cem\u003e“The concept is great and methodically and didactically well thought out. We all noticed that further development is continually going on here - indispensable in dealing with this topic today. The support and guidance from the help desk and forum were also outstanding. Thank you.”\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003eKerstin: \u003cem\u003e“I have to honestly say that I am impressed by what you’ve accomplished here. The course was totally professional and the tasks were set up so that it was possible to learn a lot. It was important for me to get an overview of the technologies and relationships between them. The class was taught really well and it was fun too.”\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003eClaudia; \u003cem\u003e“I enjoyed this course so much. It gave me a chance to expand my horizons in web technologies a great deal. I really liked the practical homework exercises, especially the calculation task in Week 5. I’m already looking forward to the next course. Keep up the good work!”\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003eYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de/\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eKursbildquelle: jmtosses / \u003ca href=\"https://www.flickr.com/photos/jmt/3838802631/in/photolist-6RdShg-5FEomd-dNTE9j-7FUMaN-4reUTb-744i35-pboedq-fG1Nz1-9o37gL-5mGRNj-bggAZz-psABfH-5mGRK3-otewDG-5mGRPs-5mGRM5-5mCBFa-5mGRFN-5mGRLf-m3qGTX-GCPob-n2J5n-243BrF-5HLWbU-p9zCdy-eqb3h-pqQRym-kYwZxk-GCPg9-bEtm3p-9JnRKp-6fGffL-cAswZb-cEtrZw-pboY5e-pboxjy-pbnJYt-n9Nxa3-BMYbN-4V7PPt-dw5ZnX-cacNad-cNpobo-edZr5c-9hVjTU-nWApzE-cyNqNJ-tC2o4q-3qHFZ-ahKGfo\"\u003eFlickr\u003c/a\u003e - \u003ca href=\"https://creativecommons.org/licenses/by-nc/2.0/\"\u003eCC BY-NC-ND 2.0\u003c/a\u003e\u003c/p\u003e\n","image":"https://open.hpi.de/files/45ce8877-d21b-4389-9032-c6525b4724d0?name=","next_events":[],"language":"en","categories":["IT Security","IT Technical Principles"],"status":"archive"},{"id":"c5600abf-5abf-460b-ba6f-1d030053fd79","title":"Java für Einsteiger","url":"https://open.hpi.de/courses/c5600abf-5abf-460b-ba6f-1d030053fd79","start_date":"2015-04-13T08:00:00.000+00:00","end_date":"2015-05-28T23:30:00.000+00:00","teacher":"openHPI Team","code":"javaeinstieg2015","abstract":"Mit diesem neuen openHPI Einsteigerkurs möchten wir unseren Teilnehmern die Grundlagen der Programmiersprache Java vermitteln.\r\nJava ist weit verbreitet und wird vielseitig eingesetzt. Unter anderem werden mit Java Programme für Googles Android Plattform entwickelt.\r\nDieser MOOC vermittelt die grundlegenden Konzepte des Programmierens einfach und verständlich. Durch regelmäßige praktische Übungen wird das Gelernte angewendet und gefestigt. \r\nWir sprechen mit diesem Kurs alle Einsteiger an, die sich für die Programmierung in Java interessieren. Voraussetzung ist ein starkes Interesse an der Funktionsweise von Programmen am Computer, Programmiererfahrung ist jedoch nicht notwendig.\r\nUnsere Teilnehmer benötigen lediglich einen Computer mit einem Internetzugang und einem Browser.\r\n\r\n\r\n\r\n","description":"\u003cp\u003e\u003cstrong\u003e4 Wochen Intensivkurs\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eMit diesem neuen openHPI Einsteigerkurs möchten wir unseren Teilnehmern die Grundlagen der Programmiersprache Java vermitteln.\nJava ist weit verbreitet und wird vielseitig eingesetzt. Unter anderem werden mit Java Programme für Googles Android Plattform entwickelt.\nDieser Kurs vermittelt die grundlegenden Konzepte des Programmierens einfach und verständlich. Durch regelmäßige praktische Übungen wird das Gelernte angewendet und gefestigt. \nWir sprechen mit diesem Kurs alle Einsteiger an, die sich für die Programmierung in Java interessieren. Voraussetzung ist ein starkes Interesse an der Funktionsweise von Programmen am Computer, Programmiererfahrung ist jedoch nicht notwendig.\nUnsere Teilnehmer benötigen lediglich einen Computer mit einem Internetzugang und einem Browser.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://open.hpi.de/courses/javawork2015\"\u003e2 Wochen Workshop\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eAls Ergänzung zu diesem Kurs wird ein zweiwöchiger Workshop angeboten der eine Einführung in die Benutzung einer Java IDE (Integrated Development Environment = Programmierumgebung) geben wird.\nDieser Kurs wird die Teilnehmer dazu befähigen, das erlernte Wissen aus dem Programmierkurs zu festigen und eigene Programme umzusetzen.\u003c/p\u003e\n\n\u003cp\u003eWeitere Video Lectures finden Sie unter \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eKursbildquelle: Jack Kennard / \u003ca href=\"https://www.flickr.com/photos/javajoba/7240768126/in/photostream/\"\u003eFlickr\u003c/a\u003e - \u003ca href=\"https://creativecommons.org/licenses/by-nc-nd/2.0/\"\u003eCC BY-NC-ND 2.0\u003c/a\u003e\u003c/p\u003e\n","image":"https://open.hpi.de/files/c2bf9e16-8ff1-4ef0-b3d3-d8eee64f1907?name=","next_events":[],"language":"de","categories":["Programming"],"status":"archive"},{"id":"e3e4fa69-ba06-46ba-be72-c40ab95bd2cb","title":"Automated Visual Software Analytics","url":"https://open.hpi.de/courses/e3e4fa69-ba06-46ba-be72-c40ab95bd2cb","start_date":"2015-03-10T08:00:00.000+00:00","end_date":"2015-05-04T22:00:00.000+00:00","teacher":"Prof. Dr. Jürgen Döllner","code":"softwareanalytics2015","abstract":"In this MOOC, we explore how the effectiveness of software development projects can be pro-actively improved by applying concepts, techniques, and tools from software diagnosis. The term \"software diagnosis\" refers to recently innovated techniques from automated software analysis and software visual analytics that aim at giving insights into information about complex software system implementations, the correlated software development processes, and the system evolution.\r\n\r\nAs precondition, our interested learners for this course shall have general knowledge about software development processes and procedures and have experience in IT-systems development or software maintenance.\r\n\r\n","description":"\u003cp\u003eIn this MOOC, we explore how the effectiveness of software development projects can be pro-actively improved by applying concepts, techniques, and tools from software diagnosis. The term \u0026quot;software diagnosis\u0026quot; refers to recently innovated techniques from automated software analysis and software visual analytics that aim at giving insights into information about complex software system implementations, the correlated software development processes, and the system evolution. To this end, all common, traditionally separated infomation sources of software development get automatically extracted, related, and combined. The ultimate goals of these techniques are to provide not only software engineers but also all other stakeholders better instruments to monitor, to comprehend, to discuss, and to steer software development activities. In particular we will investigate how \u0026quot;software maps\u0026quot; as cartography-oriented, general-purpose, powerful visual analytics instruments can be used to improve software development effectiveness and transparency. \u003c/p\u003e\n\n\u003cp\u003eAs precondition, our interested learners for this course shall have general knowledge about software development processes and procedures and have experience in IT-systems development or software maintenance. This course is especially interesting for \u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eIT-project managers\u003c/li\u003e\n\u003cli\u003eSoftware developers, software testers and software engineers\u003c/li\u003e\n\u003cli\u003eSoftware architects and modelers\u003c/li\u003e\n\u003cli\u003eParties responsible for financing the IT-development in a company\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eCourse Contents\u003c/h2\u003e\n\n\u003ch3\u003eIntroduction to Software Engineering (week 1)\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eSoftware Dependency\u003c/li\u003e\n\u003cli\u003eSoftware Development\u003c/li\u003e\n\u003cli\u003eSoftware Complexity\u003c/li\u003e\n\u003cli\u003eSoftware Maintenance\u003c/li\u003e\n\u003cli\u003eStatic Source Code Analysis\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eSoftware Metrics (week 2)\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eSoftware Metrics\u003c/li\u003e\n\u003cli\u003eLines-of-Code (LoC)\u003c/li\u003e\n\u003cli\u003eCode Duplicates\u003c/li\u003e\n\u003cli\u003eNesting Level (NL)\u003c/li\u003e\n\u003cli\u003eCyclomatic Complexity (McCabe)\u003c/li\u003e\n\u003cli\u003eHalstead Complexity\u003c/li\u003e\n\u003cli\u003eModule Dependencies\u003c/li\u003e\n\u003cli\u003eOO Metrics\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eAnalytics (week 3)\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eAnalytics\u003c/li\u003e\n\u003cli\u003eVisual Analytics\u003c/li\u003e\n\u003cli\u003eVisualization Pipeline\u003c/li\u003e\n\u003cli\u003ePredictive Analytics\u003c/li\u003e\n\u003cli\u003eSoftware Analytics\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eAutomated Data Mining and Visualization Techniques (week 4)\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eVersion Control Systems\u003c/li\u003e\n\u003cli\u003eMining SW Repositories\u003c/li\u003e\n\u003cli\u003eTreemaps\u003c/li\u003e\n\u003cli\u003e2.5D Treemaps\u003c/li\u003e\n\u003cli\u003eHierarchical Circular Bundle Views\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eApplying Visual Software Analytics (week 5)\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eSoftware Maps\u003c/li\u003e\n\u003cli\u003eExploring System Implementations\u003c/li\u003e\n\u003cli\u003eDiscovering Error-Prone Code\u003c/li\u003e\n\u003cli\u003eMonitoring Technical Debts\u003c/li\u003e\n\u003cli\u003eInvolvement and Knowledge Distribution\u003c/li\u003e\n\u003cli\u003eRefactoring Planning\u003c/li\u003e\n\u003cli\u003eMonitoring Redesign Processes\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eRelated Techniques and Outlook (week 6)\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eTracing\u003c/li\u003e\n\u003cli\u003eTraceViews\u003c/li\u003e\n\u003cli\u003eCode Usage \u0026amp; Test Coverage\u003c/li\u003e\n\u003cli\u003eSoftware Effectiveness\u003c/li\u003e\n\u003cli\u003ePrescriptive Software Analytics\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eLearning Objectives\u003c/h2\u003e\n\n\u003cp\u003eAt the conclusion of this course, participants should be able to \u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eoutline concepts and methods from scientific fields that contribute to software analytics;\u003c/li\u003e\n\u003cli\u003edescribe objectives underlying “data-driven” software engineering approaches;\u003c/li\u003e\n\u003cli\u003ediscuss challenges for software maintenance due to software complexity and dependency;\u003c/li\u003e\n\u003cli\u003elist, describe, and compare software metrics as quality measures used in software analytics;\u003c/li\u003e\n\u003cli\u003eoutline and contrast different visualization techniques used by software analytics;\u003c/li\u003e\n\u003cli\u003eobtain first experience in using automated visual software analytics tools; \u003c/li\u003e\n\u003cli\u003ereflect on using elements of automated visual software analytics in own projects\u000bas means to improve effectiveness of software development processes.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/f6691c78-0b5f-4eeb-97e0-5ea884d82fc2?name=","next_events":[],"language":"en","categories":["IT Technical Principles"],"status":"archive"},{"id":"ee7b66a8-d0fa-40f3-ae70-7469920cbfd8","title":"Sichere Email","url":"https://open.hpi.de/courses/ee7b66a8-d0fa-40f3-ae70-7469920cbfd8","start_date":"2015-02-09T09:00:00.000+00:00","end_date":"2015-03-06T23:30:00.000+00:00","teacher":"Prof. Dr. Christoph Meinel","code":"ws-email2015","abstract":"Email ist eines der wichtigsten Kommunikationsmittel unserer Zeit. Dennoch lässt die Technologie hinsichtlich Sicherheit deutlich zu wünschen übrig. Als Email-Nutzer kann man sich weder sicher sein, dass niemand die Nachrichten mitliest, noch dass diese auch unverändert beim Empfänger ankommen. Um geeignete Sicherheitsmaßnahmen - die sogenannte Ende-zu-Ende-Verschlüsselung sowie digitale Signaturen - muss sich jeder einzelne Nutzer selbst kümmern.\r\n\r\nIn diesem openHPI-Workshop lernen Sie auch anhand praktischer Übungen, wie Sie mit dem Einsatz kostenloser Werkzeuge verschlüsselte und digital unterschriebene Emails versenden und empfangen können.","description":"\u003cp\u003eEmail ist eines der wichtigsten Kommunikationsmittel unserer Zeit. Dennoch lässt die Technologie hinsichtlich Sicherheit deutlich zu wünschen übrig. Als Email-Nutzer kann man sich weder sicher sein, dass niemand die Nachrichten mitliest, noch dass diese auch unverändert beim Empfänger ankommen. Um geeignete Sicherheitsmaßnahmen - die sogenannte Ende-zu-Ende-Verschlüsselung sowie digitale Signaturen - muss sich jeder einzelne Nutzer selbst kümmern.\u003c/p\u003e\n\n\u003cp\u003eIn diesem openHPI-Workshop lernen Sie auch anhand praktischer Übungen, wie Sie mit dem Einsatz kostenloser Werkzeuge verschlüsselte und digital unterschriebene Emails versenden und empfangen können.\u003c/p\u003e\n\n\u003cp\u003eWir laden Sie ein, sich \u003ca href=\"https://www.youtube.com/watch?v=EZcS5rg1Q3s\"\u003ehier\u003c/a\u003e (Link zum Einführungsvideo) genauer über die Inhalte des Workshops zu informieren.\u003c/p\u003e\n\n\u003cp\u003eDieser Kurs findet im Rahmen des \u003ca href=\"http://www.saferinternetday.org/web/germany/home\"\u003eSafer Internet Day\u003c/a\u003e statt. Dies ist eine weltweite Initiative der EU-Kommission zum Thema Internetsicherheit, bei der wir mit \u003ca href=\"http://www.lehrer-online.de\"\u003eLehrer Online\u003c/a\u003e kooperieren.\nBei \u003ca href=\"http://www.lehrer-online.de\"\u003ewww.lehrer-online.de\u003c/a\u003e finden Lehrkräfte Unterrichtsmaterialien und aktuelle Informationen rund um die sichere Internet-Nutzung in der Schule und anderen Bildungkontexten. \u003c/p\u003e\n\n\u003cp\u003eWeitere Video Lectures finden Sie unter \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"http://hpi.de/pressemitteilungen/2015/e-mail-verschluesselung-hpi-bietet-zu-safer-internet-day-onlineworkshop-an.html\"\u003ePressemitteilung zum Kurs auf dem HPI Presseportal.\u003c/a\u003e\u003c/p\u003e\n\n\u003cp\u003eDas sagen Kursteilnehmer über uns:\u003c/p\u003e\n\n\u003cp\u003eDieter K:\n\u003cem\u003e\u0026quot;Besten Dank für den Kurs - der Stoff war prima aufbereitet und hat sehr viel Spass gemacht. Ich werde das Thema für mich in jedem Fall vertiefen und natürlich auch anwenden. Ich freue mich schon auf die nächsten Kurse.\u0026quot;\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003eClaus N.\n\u003cem\u003e\u0026quot;Ich bin begeistert von Ihrem Online-Angebot. Nach einer solchen Weiterbildungsmöglichkeit habe ich schon lange gesucht. Wegen meiner Projekttätigkeiten ist die Möglichkeit meine \u0026quot;Unterrichtsstunden\u0026quot; frei einzuteilen einfach exzellent. Danke an alle, die ein solches Angebot möglich machen.\u0026quot;\u003c/em\u003e\u003c/p\u003e\n","image":"https://open.hpi.de/files/309f9456-8128-4496-9434-d3ec256b3de1?name=","next_events":[],"language":"de","categories":["IT Basic Knowledge","IT Security"],"status":"archive"},{"id":"2fdd289b-a342-4d3e-adc1-3c4d1cd14e5b","title":"In-Memory Data Management  (2014) - Implications on Enterprise Systems","url":"https://open.hpi.de/courses/2fdd289b-a342-4d3e-adc1-3c4d1cd14e5b","start_date":"2014-09-01T08:00:00.000+00:00","end_date":"2014-11-03T23:30:00.000+00:00","teacher":"Prof. Hasso Plattner","code":"imdb2014","abstract":"The online course of Prof. Hasso Plattner focuses on the management of enterprise data in column-oriented in-memory databases. Latest hardware and software trends led to the development of a new revolutionary technology that enables flexible and lightning-fast analysis of massive amounts of enterprise data. The basic concepts and design principles of this technology are explained in detail. Beyond that, the implications of the underlying design principles for future enterprise applications and their development are discussed. The course concludes with several examples that show the benefits of the presented concepts and help you understand why a columnar in-memory database is superior over traditional row-oriented ones.","description":"\u003cp\u003e„In-Memory Data Management\u0026quot; focuses on the management of enterprise data in column-oriented in-memory databases. Latest hardware and software trends led to the development of a new revolutionary database technology that enables flexible and lightning-fast analysis of massive amounts of enterprise data. The basic concepts and design principles of this technology are explained in detail. Beyond that, the implications of the underlying design principles for future enterprise applications and their development are discussed. The course will explain in detail the differences and advantages of an in-memory column-oriented database in contrast to traditional row-oriented disk-based storages. The following topics are covered (among others):\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eRequirements for Modern Enterprise Computing,  Enterprise Application Characteristics\u003c/li\u003e\n\u003cli\u003eHardware Trends, Columnar Storage vs. Row Storage\u003c/li\u003e\n\u003cli\u003eDictionary Encoding, Compression \u003c/li\u003e\n\u003cli\u003eScans, Selects, Deletes, Inserts, Updates \u003c/li\u003e\n\u003cli\u003e Indices, Joins\u003c/li\u003e\n\u003cli\u003eApplications\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/53a190c1-9e25-4670-b19f-30766c066768?name=","next_events":[],"language":"en","categories":["Recent developments"],"status":"archive"},{"id":"2d1ede48-4cc6-4a36-bcc4-6cb02e36b3ea","title":"Knowledge Engineering with Semantic Web Technologies","url":"https://open.hpi.de/courses/2d1ede48-4cc6-4a36-bcc4-6cb02e36b3ea","start_date":"2014-05-26T08:00:00.000+00:00","end_date":"2014-07-27T22:00:00.000+00:00","teacher":"Dr. Harald Sack","code":"semanticweb2014","abstract":"The knowledge contained in the World Wide Web is available in interlinked documents written in natural language. To make use of this knowledge, technologies such as natural language processing, information retrieval, data and knowledge mining must be applied. Semantic Web technologies follow an alternative approach by complementing web documents with explicit semantics based on formal knowledge representations, such as e.g. ontologies. In this course, you will learn the fundamentals of Semantic Web technologies and how they are applied for knowledge representation in the World Wide Web. You will learn how to represent knowledge with ontologies and how to access and benefit from semantic data on the Web. Furthermore, you will also learn how to make use of Linked Data and the Web of Data,  currently the most popular applications based on Semantic Web technologies. \r\n","description":"\u003cp\u003eThe web has become an object of our daily life and the amount of information in the web is ever growing. Besides plain texts, especially multimedia information such as graphics, audio or video have become a predominant part of the web\u0026#39;s information traffic. But, how can we find useful information within this huge information space? How can we make use of the knowledge contained in those web documents? Traditional search engines for example will reach the limits of their power, when it comes to understanding information content. The Semantic Web is an extension of the traditional web in the sense that information in the form of natural language text in the web will be complemented by its explicit semantics based on a formal knowledge representation. Thus, the meaning of information expressed in natural language can be accessed in an automated way and interpreted correctly, i.e. it can be ‘understood’ by machines.\u003c/p\u003e\n\n\u003cp\u003eSemantic Web technologies enable the explicit representation of knowledge and its further processing to deduce new knowledge from implicitly hidden knowledge. Thus, information access and information search will be more precise and more complete compared to today\u0026#39;s traditional information retrieval technology. Previously heterogeneous data can be mapped and combined based on common knowledge representation and schemata easily extended in a dynamic way.\u003c/p\u003e\n\n\u003cp\u003eIn this course, you will learn the fundamentals of Semantic Web technologies and how they are applied for knowledge representation in the World Wide Web. You will learn how to represent knowledge with ontologies and how to access and benefit from semantic data on the Web. Furthermore, you will also learn how to make use of Linked Data and the Web of Data,  currently the most popular applications based on Semantic Web technologies. \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eRequirements for this course:\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003ea basic knowledge of the foundations of mathematical logics, i.e.\npropositional logics and first order logics \u003c/li\u003e\n\u003cli\u003ea basic understanding of    web technologies, such as URL, http,\nHTML, and XML-based technologies\u003c/li\u003e\n\u003cli\u003ea basic knowledge of database technology, esp. relational databases\u003cbr\u003e\nand SQL query language\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/ce0a76af-281b-4649-84f5-d4bfddb1f171?name=","next_events":[],"language":"en","categories":["IT Technical Principles"],"status":"archive"},{"id":"f8a1eedb-bc06-4608-9604-fa7da5562f96","title":"Internetworking with TCP/IP (2014)","url":"https://open.hpi.de/courses/f8a1eedb-bc06-4608-9604-fa7da5562f96","start_date":"2014-03-31T08:00:00.000+00:00","end_date":"2014-05-23T21:00:00.000+00:00","teacher":"Prof. Dr. Christoph Meinel","code":"internetworking2014","abstract":"Have you ever thought about how often you turn to the Internet throughout the day? Whether it be ordering a book or ticket online, checking the latest news or writing an email, everyday life without the Internet is nearly unimaginable. But wouldn’t it be nice to know how all of this is possible? This course will teach you about the technological foundation of this worldwide network. You will learn about its physical foundation of data transmission based on the functional principles and technologies of local area networks (LANs) and wide area networks (WANs). The TCP/IP reference model – the “heart” of the Internet – and its protocols and countless applications, will be presented in the units to follow. Participants will gain comprehensive insight into the complex world of Internet technologies. In clear terms, you will receive the knowledge to unlock the mysteries of the Internet.","description":"\u003cp\u003eHave you ever thought about how often you turn to the Internet throughout the day? Whether it be ordering a book or ticket online, checking the latest news or writing an email, everyday life without the Internet is nearly unimaginable. But wouldn’t it be nice to know how all of this is possible? This course will teach you about the technological foundation of this worldwide network. You will learn about its physical foundation of data transmission based on the functional principles and technologies of local area networks (LANs) and wide area networks (WANs). The TCP/IP reference model – the “heart” of the Internet – and its protocols and countless applications, will be presented in the units to follow. Participants will gain comprehensive insight into the complex world of Internet technologies. In clear terms, you will receive the knowledge to unlock the mysteries of the Internet.\u003c/p\u003e\n\n\u003cp\u003eYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/c65df5b1-45ad-4d22-b9f2-251639c0771d?name=","next_events":[],"language":"en","categories":["IT Security","IT Technical Principles"],"status":"archive"},{"id":"2efebcdd-0749-4ca3-8396-58a09e7bf070","title":"Parallel Programming Concepts (2014)","url":"https://open.hpi.de/courses/2efebcdd-0749-4ca3-8396-58a09e7bf070","start_date":"2014-02-02T23:00:00.000+00:00","end_date":"2014-03-28T22:55:00.000+00:00","teacher":"Dr. Peter Tröger","code":"parprog2014","abstract":"“Parallel Programming Concepts” presents relevant theoretical and practical foundations for parallel programming. We show crucial theoretical ideas such as semaphores and actors, the architecture of modern parallel hardware, different programming models such as task parallelism, message passing and functional programming, and several patterns and best practices. The course is suitable for all participants who are interested in getting a broader overview of parallelism, especially beyond the usage of multiple threads.","description":"\u003cp\u003eSince the very beginning of computer technology, processors have been built with ever-increasing clock frequencies and smarter optimizations for achieving a faster software execution. Developers and the software industry are used to applications becoming faster by merely exchanging the underlying hardware. However, since the beginning of the century it has become apparent that this approach no longer works.\u003c/p\u003e\n\n\u003cp\u003eMoore\u0026#39;s law about the ever-increasing number of transistors per chip is still valid, but power consumption, thermal management and memory latency issues are making make serial code acceleration increasingly harder. Instead, hardware vendors now use additional transistors for multiple processing elements (‘cores’) per processor chip and deeper memory hierarchies. Modern hardware has the capability to transform any desktop, server, or even mobile system into some kind of parallel computer. This makes parallel programming the new default for application development. The exploitation of any additional horsepower from hardware is now in the responsibility of the software.\u003c/p\u003e\n\n\u003cp\u003eThe openHPI online course “Parallel Programming Concepts” presents relevant theoretical and practical foundations for parallel programming. We show crucial theoretical ideas such as semaphores and actors, the architecture of modern parallel hardware, different programming models such as task parallelism, message passing and functional programming, and several patterns and best practices.\u003c/p\u003e\n\n\u003cp\u003eThe course is suitable for all participants who are interested in getting a broader overview of parallelism, especially beyond the usage of multiple threads. Participants should have knowledge in at least one programming language - other skills are not necessary.\u003c/p\u003e\n\n\u003cp\u003eYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/684e4b4d-85c2-4baa-8bac-41acd10dff32?name=","next_events":[],"language":"en","categories":["IT Technical Principles"],"status":"archive"},{"id":"8a82ba33-0383-499b-8631-3864ad26a56b","title":"In-Memory Data Management  (2013)","url":"https://open.hpi.de/courses/8a82ba33-0383-499b-8631-3864ad26a56b","start_date":"2013-08-25T22:00:00.000+00:00","end_date":"2013-10-27T22:55:00.000+00:00","teacher":"Prof. Hasso Plattner","code":"imdb2013","abstract":"The online course focuses on the management of enterprise data in column-oriented in-memory databases. Latest hardware and software trends led to the development of a new revolutionary technology that enables flexible and lightning-fast analysis of massive amounts of enterprise data. The basic concepts and design principles of this technology are explained in detail. Beyond that, the implications of the underlying design principles for future enterprise applications and their development are discussed. Unbelievable things are possible and you will understand why this is true using an in-memory column-oriented database instead of a traditional row-oriented disk-based one.","description":"\u003cp\u003eThe online course focuses on the management of enterprise data in column-oriented in-memory databases. Latest hardware and software trends led to the development of a new revolutionary technology that enables flexible and lightning-fast analysis of massive amounts of enterprise data. The basic concepts and design principles of this technology are explained in detail. Beyond that, the implications of the underlying design principles for future enterprise applications and their development are discussed. Unbelievable things are possible and you will understand why this is true using an in-memory column-oriented database instead of a traditional row-oriented disk-based one.\u003c/p\u003e\n\n\u003cp\u003eYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/e85a389d-a46f-4fa3-958c-125dc9735860?name=","next_events":[],"language":"en","categories":["Recent developments"],"status":"archive"},{"id":"37bf86a8-effc-45be-9278-c6aa65785463","title":"Web-Technologien (2013)","url":"https://open.hpi.de/courses/37bf86a8-effc-45be-9278-c6aa65785463","start_date":"2013-06-02T22:00:00.000+00:00","end_date":"2013-07-31T21:55:00.000+00:00","teacher":"Prof. Dr. Christoph Meinel","code":"www","abstract":"Das Web – eigentlich nichts anderes als ein einfacher Informationsdienst im Internet – hat eine ganz neue digitale Welt entstehen lassen, die eng verwoben mit unserer realen Welt früher Unvorstellbares möglich macht: sekundenschnelle Kommunikation über Kontinente, Filme auf dem Smartphone anschauen, mit Partnern in entfernten Ländern spielen oder Fotos anschauen oder vom Sofa aus einkaufen und Bankgeschäfte tätigen… In unserem Onlinekurs zu den Web-Technologien lernen Sie, wie das alles funktioniert. Zunächst besprechen wir die dem Web zugrundeliegenden Basistechnologien URI, HTTP, HTML, CSS und XML. Auch wenn das zunächst sehr kryptisch klingt, werden Sie schnell verstehen, worum es geht. Wir sehen uns dann Webservices und die Techniken der Webprogrammierung an und üben diese ein. Dann werden wir uns mit der Frage beschäftigen, wie Suchmaschinen, die uns als Webweiser in der digitalen Welt so schnell und zuverlässig helfen, Inhalte und Dienstangebote im Web zu finden, eigentlich funktionieren. Der Kurs schließt mit einem Ausblick auf das Cloud Computing, das die Art und Weise, wie wir in Zukunft auf Rechenleistungen zugreifen werden, grundlegend verändert.","description":"\u003cp\u003eDas Web – eigentlich nichts anderes als ein einfacher Informationsdienst im Internet – hat eine ganz neue digitale Welt entstehen lassen, die eng verwoben mit unserer realen Welt früher Unvorstellbares möglich macht: sekundenschnelle Kommunikation über Kontinente, Filme auf dem Smartphone anschauen, mit Partnern in entfernten Ländern spielen oder Fotos anschauen oder vom Sofa aus einkaufen und Bankgeschäfte tätigen… In unserem Onlinekurs zu den Web-Technologien lernen Sie, wie das alles funktioniert. Zunächst besprechen wir die dem Web zugrundeliegenden Basistechnologien URI, HTTP, HTML, CSS und XML. Auch wenn das zunächst sehr kryptisch klingt, werden Sie schnell verstehen, worum es geht. Wir sehen uns dann Webservices und die Techniken der Webprogrammierung an und üben diese ein. Dann werden wir uns mit der Frage beschäftigen, wie Suchmaschinen, die uns als Webweiser in der digitalen Welt so schnell und zuverlässig helfen, Inhalte und Dienstangebote im Web zu finden, eigentlich funktionieren. Der Kurs schließt mit einem Ausblick auf das Cloud Computing, das die Art und Weise, wie wir in Zukunft auf Rechenleistungen zugreifen werden, grundlegend verändert.\u003c/p\u003e\n\n\u003cp\u003eWeitere Video Lectures finden Sie unter \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/5c8eb589-ca86-4e1d-b2b8-c50cca7237ea?name=","next_events":[],"language":"de","categories":["IT Security","IT Technical Principles"],"status":"archive"},{"id":"649d026d-3cbb-43c1-9290-8dcecacb3fab","title":"Datenmanagement mit SQL (2013)","url":"https://open.hpi.de/courses/649d026d-3cbb-43c1-9290-8dcecacb3fab","start_date":"2013-04-07T22:00:00.000+00:00","end_date":"2013-06-02T21:55:00.000+00:00","teacher":"Prof. Dr. Felix Naumann","code":"sql","abstract":"Im openHPI Kurs \"Datenmanagement mit SQL\" lernen Sie die Grundlagen von modernen Datenbanksystemen kennen. Wir untersuchen ihren Aufbau, wir planen den Entwurf von Datenbanken und schließlich lernen Sie die weltweit dominierende Anfragesprache SQL kennen.","description":"\u003cp\u003eDatenbanken bilden die Basis fast aller großen Software-Anwendungen. In Unternehmen, in der Forschung, im Web – überall entstehen riesige Datenmengen, die es gilt sicher zu speichern und die effizient abfragbar sein müssen. In dem openHPI Kurs \u0026quot;Datenmanagement mit SQL\u0026quot; lernen wir die Grundlagen von modernen Datenbanksystemen kennen. Wir untersuchen ihren Aufbau, wir planen den Entwurf von Datenbanken und schließlich lernen wir die weltweit dominierende Anfragesprache SQL kennen. Mittels SQL kann man einfach formulierte aber sehr mächtige Anfragen an eine Datenbank senden. Diese Anfragen können Daten suchen, Daten filtern und sortieren, und schließlich Daten auf vielfältige Weise analysieren. Hin und wieder verlassen wir diese Anwendersicht und erfahren wie ein Datenbanksystem die Nutzeranweisungen umsetzt, zum Beispiel um komplexe Operationen besonders effizient umzusetzen.\u003c/p\u003e\n\n\u003cp\u003eWeitere Video Lectures finden Sie unter \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/943bbcd4-2ac4-4911-9877-f6d39917f8c7?name=","next_events":[],"language":"de","categories":["IT Basic Knowledge"],"status":"archive"},{"id":"bca1821e-f7fa-4c89-88a0-87ac1732bae8","title":"Semantic Web Technologies (2013)","url":"https://open.hpi.de/courses/bca1821e-f7fa-4c89-88a0-87ac1732bae8","start_date":"2013-02-03T23:00:00.000+00:00","end_date":"2013-04-07T21:55:00.000+00:00","teacher":"Dr. Harald Sack","code":"semanticweb","abstract":"The Web has become an object of our daily life and the amount of information in the web is ever growing. Besides plain texts, especially multimedia information such as graphics, audio or video has become a predominant part within the web's information traffic. But, how to find some useful information within this huge information space? Traditional search engines will come to the limits of their powers, when it comes to understanding information content. The Semantic Web is an extension of the traditional web in the sense that the information implicitly contained in natural language text is complemented by explicit semantics based on formal knowledge representation. In this course, you will learn the fundamentals of Semantic Web technologies. You will learn how to represent knowledge and how to access and benefit from semantic data on the Web.","description":"\u003cp\u003eThe Web has become an object of our daily life and the amount of information in the web is ever growing. Besides plain texts, especially multimedia information such as graphics, audio or video have become a predominant part of the web\u0026#39;s information traffic. But, how can we find useful information within this huge information space? Traditional search engines will reach the limits of their power, when it comes to understanding information content. The Semantic Web is an extension of the traditional web in the sense that information in the form of natural language text in the web will be complemented by its explicit semantics based on a formal knowledge representation. Thus, the meaning of information expressed in natural language can be accessed in an automated way and interpreted correctly, i.e. it can be understood by machines.\u003c/p\u003e\n\n\u003cp\u003eSemantic Web technologies enable the explicit representation of knowledge and its further processing to deduce new knowledge from implicitly hidden knowledge. Thus, information access and information search will be more precise and more complete compared to today\u0026#39;s traditional information retrieval technology. Previously heterogeneous data can be mapped and combined based on common knowledge representation and schemata easily extended in a dynamic way.\u003c/p\u003e\n\n\u003cp\u003eIn this course, you will learn the fundamentals of Semantic Web technologies. You will learn how to represent knowledge and how to access and benefit from semantic data on the Web.\u003c/p\u003e\n\n\u003cp\u003eYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/a88a238e-9f5f-46b0-8fcd-d1809ee63c20?name=","next_events":[],"language":"en","categories":["IT Technical Principles"],"status":"archive"},{"id":"e2bcb00f-0872-4d9b-828b-d347a862b4ec","title":"Internetworking mit TCP/IP (2012)","url":"https://open.hpi.de/courses/e2bcb00f-0872-4d9b-828b-d347a862b4ec","start_date":"2012-11-04T23:00:00.000+00:00","end_date":"2012-12-24T22:55:00.000+00:00","teacher":"Prof. Dr. Christoph Meinel","code":"internetworking","abstract":"Das Internet ist zu einem festen Bestandteil unseres täglichen Lebens geworden. Auf welchen technologischen Grundlagen das weltumspannende Internet arbeitet, lernen Sie in diesem Kurs. Ausgehend von den physikalischen Grundlagen der Datenübertragung werden zunächst die Funktionsprinzipien und Technologien der lokalen Netzwerke (LANs) und der Weitverkehrsnetzwerke (WANs) veranschaulicht. Allgemein verständlich wird in den weiteren Einheiten das dem Internet zugrunde liegende TCP/IP-Referenzmodell, sowie dessen Protokolle und zahlreichen Anwendungen vermittelt. Der Teilnehmer erfährt in dem Kurs einen umfassenden Einblick in die komplexe Welt der Internet-Technologien.","description":"\u003cp\u003eIn diesem Kurs sollen Sie lernen, mit welchen technologischen Grundlagen das weltumspannende Internet arbeitet. Nach einem allgemeinen Überblick, der die Komplexität des IT-Systems \u0026quot;Internet\u0026quot; verdeutlicht, werden zunächst die Funktionsprinzipien und Technologien der lokalen Netzwerke (LANs) und der Weitverkehrsnetzwerke (WANs) veranschaulicht. In den weiteren Einheiten wird das dem Internet zugrunde liegende TCP/IP-Referenzmodell, sowie dessen Protokolle und die Funktionsweise einiger der zahlreichen Anwendungen vermittelt.\u003c/p\u003e\n\n\u003cp\u003eWeitere Video Lectures finden Sie unter \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/5df372a4-714b-45d1-bbb2-612932f476f0?name=","next_events":[],"language":"de","categories":[],"status":"archive"},{"id":"e84ffbdd-4312-4efb-8590-2c10aaf03a49","title":"In-Memory Data Management  (2012)","url":"https://open.hpi.de/courses/e84ffbdd-4312-4efb-8590-2c10aaf03a49","start_date":"2012-09-02T22:00:00.000+00:00","end_date":"2012-11-01T22:55:00.000+00:00","teacher":"Prof. Hasso Plattner","code":"imdb2012","abstract":"The online course focuses on the management of enterprise data in column-oriented in-memory databases. Latest hardware and software trends led to the development of a new revolutionary technology that enables flexible and lightning-fast analysis of massive amounts of enterprise data. The basic concepts and design principles of this technology are explained in detail. Beyond that, the implications of the underlying design principles for future enterprise applications and their development are discussed. Unbelievable things are possible and you will understand why this is true using an in-memory column-oriented database instead of a traditional row-oriented disk-based one.","description":"\u003cp\u003eThe online course focuses on the management of enterprise data in column-oriented in-memory databases. Latest hardware and software trends led to the development of a new revolutionary technology that enables flexible and lightning-fast analysis of massive amounts of enterprise data. The basic concepts and design principles of this technology are explained in detail. Beyond that, the implications of the underlying design principles for future enterprise applications and their development are discussed. Unbelievable things are possible and you will understand why this is true using an in-memory column-oriented database instead of a traditional row-oriented disk-based one.\u003c/p\u003e\n\n\u003cp\u003eYou\u0026#39;ll find additional video lecturing material on \u003ca href=\"http://www.tele-task.de\"\u003ewww.tele-task.de\u003c/a\u003e.\u003c/p\u003e\n","image":"https://open.hpi.de/files/5495217b-9846-4845-a4e6-5984631fd5c1?name=","next_events":[],"language":"en","categories":["Recent developments"],"status":"archive"}]}